{
  "What is the network port for FTP (data channel)?": "20",
  "What is the network port for FTP (control channel)?": "21",
  "What is the network port for FTPS (data channel)?": "989",
  "What is the network port for FTPS (control channel)?": "990",
  "What is the network port for SSH?": "22",
  "What is the network port for Telnet?": "23",
  "What is the network port for SMTP (unsecure)?": "25",
  "What is the network port for SMTP (secure)?": "587",
  "What is the network port for IMAP (unsecure)?": "143",
  "What is the network port for IMAP (secure)?": "993",
  "What is the network port for POP3 (unsecure)?": "110",
  "What is the network port for POP3 (secure)?": "995",
  "What is the network port for DNS?": "53",
  "What is the network port for DHCPv4 (server)?": "67",
  "What is the network port for DHCPv4 (client)?": "68",
  "What is the network port for HTTP?": "80",
  "What is the network port for HTTPS?": "443",
  "What is the network port for SMB using NETBIOS name services (nbname)?": "137",
  "What is the network port for SMB using NETBIOS session services (nbsession)?": "139",
  "What is the network port for SMB direct (NETBIOS-less)?": "445",
  "What is the network port for SNMP (Queries)?": "161",
  "What is the network port for SNMP (Traps)?": "162",
  "What is the network port for LDAP (unsecure)?": "389",
  "What is the network port for LDAP (secure)?": "636",
  "What is the network port for RDP?": "3389",
  "What is the network port (UDP, default) for Syslog?": "514",
  "What is the network port (TCP) for Syslog?": "601",
  "How many pins does a SODIMM DDR3 module have?": "204",
  "How many pins does a SODIMM DDR4 module have?": "260",
  "How many pins does a SODIMM DDR5 module have?": "262",
    "By default, in a typical IPv4 network, the DHCP server needs to have inbound port __ open.": "67",
  "In a typical IPv4 network, a DHCP client uses port __ to connect out to the DHCP server.": "68",
  "What is the network port for DHCPv6 (server)?": "547",
  "What is the network port for DHCPv6 (client)?": "546"
}