{
  "0": "DDR4 SODIMM modules have 260 pins. DDR3 is 204-pin. 1.8-inch is the size associated with smaller storage drives used in some laptops. 2.5-inch is the standard size for SSD storage drives.",
  "1": "The next step you should take is to reseat the memory. SODIMMs can be a bit tricky to install. They must be firmly installed, but you don’t want to press too hard and damage any components. If the laptop worked fine before the upgrade, you shouldn’t have to replace the modules or the motherboard. Windows Update will not find additional RAM.",
  "2": "It could be that the laptop is now on battery power and is set to a dimmer display and shorter sleep configuration while on battery. The laptop may not be getting AC power from the AC outlet for some reason. The battery power setting is the first thing you should check; afterward, start troubleshooting the AC adapter, cable, AC outlet, and so on. It’s too early to try replacing the display; try not to replace something until you have ruled out all other possibilities. A dim screen is not caused by OS corruption. There’s no need to plug in an external monitor; you know the video adapter is working, it’s just dim.",
  "3": "The DC jack was probably damaged when the laptop was dropped. It may have been plugged in (charging) and fallen on the plug that connects to the DC jack (which is easily damaged on many laptops). The customer probably used the laptop until the battery became discharged before noticing that the laptop wouldn’t take a charge anymore—and now it won’t turn on at all. So the battery is probably not the issue. A power adapter can be damaged, but the DC-in jack is more easily damaged. The storage drive and the BIOS/UEFI normally will not affect whether the laptop will turn on.",
  "4": "To best reduce the chance of theft, use a cable lock. This is a physical cable that can be wrapped around a sturdy object and locked to the laptop, keeping it relatively secure from theft. Incorporating biometrics means implementing a thumbprint scan or other physical characteristic scan into the authentication process. Disabling NFC means that near-field communications will be turned off, and data can’t be “beamed” to other devices. Enabling MFA means that you are implementing multi-factor authentication—for example, combining a password and biometrics. \n\nWhile none of the incorrect answers can reduce the risk of a laptop being stolen, they do decrease the chance of data being stolen. As you can guess, computer security can be incredibly deep.",
  "5": "Turning on airplane mode (the most likely cause of the problem) will disable wireless transmissions, including NFC. This is great for security purposes, but it can also disable the ability to connect to Wi-Fi networks or send/receive calls. A failed power state would render the entire device unusable; however, the question says the user was able to boot and sign on to the device. Biometric authentication is most likely not the cause of the problem in this scenario because the user is not having problems signing on to the device. Electrostatic discharge (ESD) can occur when two objects with different voltages come into contact with each other. ESD can wreak havoc with electronic components, but it is not the most likely problem here because the device appears to be working normally in all other regards—plus it’s somewhat uncommon for mobile devices. The real issue here is user error: The user did not remember that the device was in airplane mode. When you troubleshoot problems, remember that they are often user related!",
  "6": "TFT active-matrix displays are the most common in laptops that use LCDs. Passive-matrix screens have been discontinued, but you might see an older laptop that utilizes this technology. OLED technology is a newer and different technology that is not based on TFT displays but instead uses emissive display technology, meaning that each dot on the screen is illuminated by a separate diode. OLED displays can, however, be passive-matrix or active-matrix controlled. The MAC ID is the hexadecimal address associated with a network adapter, such as a Wi-Fi adapter or network card.",
  "7": "OLED (organic light-emitting diode) displays use an organic compound or film that emits light. TFT active matrix implies LCD, and neither TFT nor LCD uses organic compounds the way OLED does. In-plane switching (IPS) is a type of LCD technology that increases the available viewing angle compared to older technologies, such as twisted nematic (TN) matrix LCDs. However, IPS is generally considered inferior to OLED screens when it comes to brightness and contrast ratio when viewed from an angle. LED screens use a film and diode, but not organically in the way that OLED does, and not at such a small size.",
  "8": "A Wi-Fi card, also known as a Wi-Fi network adapter, allows you to connect to a WLAN (wireless local area network), which is essentially another name for a Wi-Fi network. LED is a type of display. A webcam is used to communicate visually and audibly with others or to record oneself. A digitizer is a device that converts tapped or written impulses on a screen into digital information that the operating system can use. A stylus is a writing device used with a digitizer or touchscreen.",
  "9": "The 2230 standard is a kind of M.2 size measuring 22×30 mm. It is common in laptops for use with Wi-Fi and Bluetooth. In comparison, a PC often uses a 2280 M.2 card. Mini PCIe is an older type of card slot that might be used for Wi-Fi cards, but it does not use measurements such as 2230 or 2280 the way that M.2 does. A digitizer is not a port at all but a device that converts tapped impulses into digital information. An RJ45 port is a networking port that allows a laptop to communicate with the rest of the network in a wired fashion—that is, if the laptop has such a port!",
  "10": "The Lightning connector is one of Apple’s proprietary charging and synchronization connectors used by iPads and iPhones, although Apple also uses USB-C. Micro-USB is used by older Android-based mobile devices, and USB-C is more common on newer Android-based devices. Thunderbolt is a high-speed hardware interface used in desktop computers, which we will discuss more in Chapter 13. IP68 deals with ingress protection against dust and water.",
  "11": "You would most likely add a microSD card (if the smartphone has a slot available for add-ons or upgrading). This is the most common method for adding long-term storage. DDR4 is a type of RAM; it is not used for adding long-term memory storage. Some smartphones use LPDDR4 as their main memory, but this is part of the system on a chip (SoC) and not accessible to the typical user. An SSD is a solid-state drive, which generally means a hard drive that is installed to a PC or laptop, connected either as SATA or M.2. SSDs are too large for smartphones and tablets. A SIM is a subscriber identity module, usually represented as a small card (mini-SIM) used in smartphones that securely stores authentication information about the user and device, such as the International Mobile Subscriber Identity (IMSI), which we will discuss more in the following chapter.",
  "12": "\"Beaming\" the information back and forth can be accomplished in a couple of ways, primarily by using near-field communication (NFC). This can only be done if the devices are in close proximity to each other. NFC is commonly used for contactless payment systems. Another potential option would be Apple’s AirDrop, but this relies on Bluetooth (for finding devices) and Wi-Fi (for transmitting data), and of course relies on using Apple-based devices. A mobile hotspot enables a smartphone or tablet to act as an Internet gateway for other mobile devices and computers. IoT stands for the Internet of Things. The question says that employees can use their mobile devices in a BYOD manner, but CYOD is a bit different. This means that employees can choose a device to use for work purposes (most likely whichever type they are more familiar with). Whether the employees can use those devices for personal purposes usually depends on company policy. IR stands for infrared, which is not commonly found on smartphones.",
  "13": "Tethering can allow a desktop computer or laptop to share the mobile device’s Internet connection. Tethering functionality can be very useful in areas where a smartphone has cellular access but a PC/laptop cannot connect to the Internet. Mobile device accessories such as headsets, speakers, game pads, extra battery packs, and protective covers are useful, but they are not used to connect to the Internet. IP codes (for example, IP68) are used to classify and rate the degree of protection against dust and water.",
  "14": "The best option is to set up a touch pen to access the smartphone’s screen directly. A smartphone may come with a touch pen (also known as a stylus pen or simply a stylus); or it may be able to have a touch pen added later. A touch pen enables a person to input information to the screen more accurately. The other devices listed will make mobility more difficult (if not impossible). The next best answer would be an external touchpad, but it isn’t the easiest solution. If the user finds that she needs the touchpad more often, then a better, more permanent solution might be to use a tablet computer instead of a smartphone.",
  "15": "SSH (Secure Shell) uses port 22. FTP uses port 21, Telnet uses port 23, and HTTPS uses port 443.",
  "16": "User Datagram Protocol (UDP) is used for streaming media. It is connectionless, whereas TCP is connection oriented and not a good choice for streaming media. RDP, which stands for Remote Desktop Protocol, is used to make connections to other computers. DHCP, which stands for Dynamic Host Configuration Protocol, is used to assign IP addresses to clients automatically. Don’t forget: DHCP is connectionless and uses UDP, too!",
  "17": "Internet Message Access Protocol (IMAP) uses port 143 by default and port 993 as a secure default. DNS uses port 53. DHCP uses port 68. HTTP uses port 80. HTTPS uses port 443. POP3 uses port 110 and 995 as a secure default. Know those ports!",
  "18": "Simple Mail Transfer Protocol (SMTP) is probably not configured properly. It deals with sending mail. POP3 receives mail. FTP sends files to remote computers. SNMP is used to manage networks.",
  "19": "The default inbound port of a DHCPv4 server is 67 (and clients use port 68 outbound). Port 22 is the inbound port of an SSH server. Port 995 is the secure inbound port of a POP3 server. Port 3389 is the default inbound port of a server that is running RDP.",
  "20": "A firewall is a hardware appliance or software application that protects one or more computers from unwanted intrusion. A switch is a device that connects multiple computers together on a LAN. A router is used to connect two or more networks. An access point (or wireless access point) allows Wi-Fi-enabled computers and devices to communicate on the LAN wirelessly.",
  "21": "A switch sends frames of data between computers by identifying the systems by their MAC addresses. A hub broadcasts data out to all computers. The computer that it is meant for accepts the data; the rest of the computers drop the information. Routers enable connections with individual high-speed interconnection points and route signals for all the computers on the LAN out to the Internet. A modem is a device that allows a computer to access the Internet by changing the digital signals of the computer to analog signals used by a typical land-based phone line.",
  "22": "A Power over Ethernet (PoE) injector sends Ethernet data and power over a single twisted pair cable to a remote device. A PD, which stands for “powered device,” is a PoE-compliant remote device that is receiving the power. A repeater extends the distance of a network connection. A firewall is a device (or software) that secures ports on a network or on an individual system. A router makes connections from one network to another or from the LAN to the Internet.",
  "23": "Managed switches can be configured when accessed from a browser or SSH or similar configuration tool. For example, you can change the device’s IP address, configure ports, and monitor the switch and other devices using SNMP. On the other hand, unmanaged switches don’t have these capabilities; they simply connect devices and computers for transmission of data over the Ethernet network. A patch panel is a physical hardware device that acts as a termination point for all of the network cables in a building. A network interface card (NIC) allows for connectivity to a computer network. It is a physical device that can be added to a computer or networking device that has an open and compatible slot.",
  "24": "An optical network terminal (ONT) is a type of network interface device (gray box) used to take an incoming fiber optic line from a provider and split it off to a customer’s premises for the purposes of Internet access, voice calls, and television. Often, the cables that go from the ONT to the inside of the customer’s premises are copper based (coaxial or possibly twisted pair). Software-defined networking (SDN) is a method of administering multiple network devices with a controller program. A patch panel is a device that terminates twisted pair cables on one side and has ports for patch cables on the other (to be connected to a switch). A network interface card (NIC) is an adapter card that can be installed to a PC that allows the system to access a wired network. Don’t confuse a NIC with a NID!",
  "25": "RFID (radio-frequency identification) is commonly used for access to areas of a building such as a server room. It is often implemented as a proximity-based ID card or badge. The other options are not usually associated with authentication. 802.11ac is a WLAN (Wi-Fi) standard that runs on 5 GHz and can provide 1 Gbps of data transfer. Fixed wireless is a wireless service that uses a fixed wireless device to provide Internet access to users in a building or a home. MIMO (multiple-input, multiple-output) is a multiple propagation technology used to increase data transfer in 802.11n and 802.11ac wireless networks, which is further enhanced with MU-MIMO in 802.11ax.",
  "26": "802.11ac (and 802.11ax) can attain speeds in excess of 1 Gbps over wireless. 802.11a and g have a typical maximum of 54 Mbps. 802.11b (rarely used today) has a maximum of 11 Mbps. 802.3ab is the IEEE specification for 1 Gbps transfer over twisted pair cables; it is wired, not wireless (and is also known as 1000BASE-T).",
  "27": "In the United States, the 2.4 GHz frequency range is broken into three categories: Channels 1–5, 6–10, and 11. By placing separate wireless networks on separate distant channels (such as 1 and 11), you can avoid overlapping and interference. 802.11ac and 802.11a are standards, not frequencies. 5 GHz uses channels such as 36, 40, 149, 153, and so on.",
  "28": "The easiest (and best) solution to this scenario would be to change the WAP’s broadcasting channel to one that is not used by any neighbors. That would first require a wireless site survey to find out what frequencies are being used. Moving the wireless access point is a potential solution but would require a bit of hands-on work because the WAP is mounted to the ceiling. Reconfiguring the WAP to use 2.4 GHz doesn’t ensure a reduction in interference; you would still need to do a wireless site survey to make sure there is no channel overlap, which is actually more likely with 2.4 GHz than with 5 GHz. And if you are doing a survey anyway, you might as well find an open channel on the 5 GHz band. A long-range fixed wireless service is the most expensive, time-consuming, and difficult solution on the list, and it isn’t necessary because the customer already has broadband Internet access!",
  "29": "Radio-frequency identification (RFID) is a wireless technology used to read information that is stored on tags. The IEEE 802.11ax standard, also referred to as Wi-Fi 6, operates using the 2.4 GHz and 5 GHz frequency bands (and 6 GHz for Wi-Fi 6E). In the United States, the Federal Communications Commission (FCC) oversees regulations for the use of fixed wireless technology, including frequency bands that can be used.",
  "30": "Apache is a type of web server that runs on Linux. It is also known as Apache HTTP Server. File servers are used to store and transfer files but not websites. Email servers deal with the sending and receiving of email via POP3, IMAP, and SMTP. Authentication servers verify the identity of users logging in and computers on the network.",
  "31": "A proxy server is a caching server used to store commonly accessed websites. Such a server can be incorporated into a web server but often runs as a standalone server. A print server manages network printers and their spooling of print jobs, priorities, and so on. A syslog server gathers logging data from network devices and allows for the easy analysis of those logs from a client workstation. A DHCP server hands out IP addresses (and other TCP/IP information) to client computers.",
  "32": "Microsoft Exchange is a type of email server software. While you could run multiple services on a single server—for example, you could run a web server and an email server on the same machine—doing so isn’t recommended. Unless you have a small office, all servers (such as file servers, authentication servers, email servers, DHCP servers, and so on) should be separate entities. SCADA is not a server; it stands for Supervisory Control and Data Acquisition and is a type of system used to control larger organizations’ infrastructures, such as heating/cooling, electricity, and so on.",
  "33": "A smart thermostat is a type of Internet of Things (IoT) device. SCADA is an industrial system that controls an organization’s infrastructure facilities. A load balancer is in charge of distributing IP traffic among multiple servers. A spam gateway is an email filtering device that removes unwanted spam (or junk) email from all email accounts on the network.",
  "34": "An intrusion prevention system (IPS) is a solution that can detect and prevent attacks from entering a LAN or an individually protected server. An IDS, on the other hand, only detects attacks and doesn’t prevent them. A proxy server is used to cache and monitor Internet traffic and other types of traffic. An authentication server is used to identify users and allow/disallow access to a system or network based on the users’ credentials.",
  "35": "The gateway address must be configured to enable a computer access to the Internet through the gateway device. By default, the subnet mask defines the IP address’s network and host portions. The DNS server takes care of name resolution. The MAC address is the address that is burned into the network adapter; it is configured by the manufacturer.",
  "36": "If you see an address with 169.254 as the first two octets, then Automatic Private IP Addressing (APIPA) is in use. This is the link-local range for IPv4. Dynamic Host Configuration Protocol (DHCP) assigns IP addresses automatically to clients but by default does not use the 169.254 network number. Static IP addresses are configured manually by the user in the IP Properties window. Class B is a range of IP networks from 128 through 191.",
  "37": "You would use the ::1 address, which is the local loopback address for IPv6. 127.0.0.1 is the local loopback address for IPv4. FE80::/10 is the range of unicast auto-configured addresses. ::0 is not valid but looks similar to how multiple zeros can be truncated with a double colon.",
  "38": "You would use a DNS server IP address. 8.8.8.8 is an example of a DNS server IP address run by Google. Anyone in the United States and many other countries is allowed to use it for DNS resolution. Remember that the DNS server is in charge of resolving (or translating) hostnames and domain names to their respective IP addresses. Note that in this example (and in Figure 9.1), the DNS server uses a public IP address. However, depending on your network configuration, clients might be set up with a DNS server that uses a private IP address (such as 192.168.1.1), which simply means that DNS is being forwarded by that system out to a DNS server on the Internet. 127.0.0.1 (the local loopback address) is the internal loopback address on any system running TCP/IP. The gateway address (for example, 192.168.0.1) allows a system access to the Internet or to other networks. The subnet mask (for example, 255.255.255.0) defines the network and host portions of an IP address.",
  "39": "Network Address Translation (NAT) is used to convert private IP addresses to public IP addresses. It allows for the connection of multiple private computers through a single public IP address (usually using some sort of router). The subnet mask defines the network portion of an IP address. DNS is in charge of resolving hostnames to IP addresses. DHCP is responsible for automatically assigning TCP/IP addresses.",
  "40": "The IP lease has expired. When this happens, the client needs to renew the address (or seek a new one from another DHCP server). An IP reservation is a reserved address to be used exclusively by a server or another special system. A DHCP scope is the range of IP addresses that a DHCP server assigns to clients. A MAC address is a unique address written to a network interface card.",
  "41": "An AAAA record associates an IPv6 address with a hostname for use with forward lookup (name to IP address). An A record associates an IPv4 address with a hostname. SOA is the Start of Authority record. MX is a Mail Exchange record, which directs email to the proper email server.",
  "42": "The best listed solution is DMARC, which enables an admin to make use of the SPF or DKIM protocols (or both) in a more secure way. SPF by itself is not as functional as DMARC. DORA is the four-step DHCP process. A VLAN is a virtual LAN, designed to organize and compartmentalize a LAN.",
  "43": "You would create a virtual LAN (VLAN). Another valid option would be to implement IP subnetting. APIPA (also known as link-local) is an IP technology that auto-assigns addresses on the 169.254 network. A virtual private network (VPN) allows remote clients to connect to a network over the Internet using a secure tunnel. IPv6 in and of itself does not compartmentalize the network. However, an IPv6 network that has been subnetted would be acceptable.",
  "44": "The DNS Mail Exchange (MX) record directs mail to an email server. An A record type stores the IPv4 address of a domain or host for forward lookup (name to IP address). An AAAA record stores the IPv6 address of a domain or host. A TXT record is used for administrative text-based notes and with email authentication methods. Know those DNS record types!",
  "45": "A local area network (LAN) is a group of computers, such as a SOHO network, located in a small area. A wide area network (WAN) is a group of one or more LANs spread over a larger geographic area. A personal area network (PAN) is a smaller computer network used by smartphones and other small computing devices. A metropolitan area network (MAN) is a group of LANs in a smaller geographic area, such as a city.",
  "46": "Cable Internet connections use an RG-6 coaxial cable that is run from a NID to the customer’s cable modem. It is connected by way of an F-connector. Twisted pair cables and RJ11 might be used by DSL or dial-up. 802.11ax is a WLAN protocol. Fiber-based services might indeed use an ST connector, but this question asks about cable Internet service.",
  "47": "A SAN (storage area network) often makes use of Fibre Channel connections and switches to connect NAS points and other data storage devices together into a super-fast network. A wide area network (WAN) is a network that connects two or more LANs together. Digital subscriber line (DSL) is a type of Internet service, as are cable Internet and wireless Internet service providers (WISPs).",
  "48": "To test a network adapter without a network connection, you use a loopback plug. This tool simulates a network connection. It can also be used to test a switch port. Punchdown tools are used to punch individual wires to a patch panel. Cable testers such as continuity testers test the entire length of a terminated cable. A tone generator and probe kit can also test a cable’s length, but it tests only one pair of wires at a time.",
  "49": "To analyze the problem, use a Wi-Fi analyzer. Because your boss is concerned about wireless networks using 802.11ac, you should display the results for 5 GHz networks, not 2.4 GHz networks. Cable certifiers are used to check long-distance wired connections, such as from a patch panel to an RJ45 jack. A loopback plug is used to simulate a network connection, which can help with identifying switch ports and testing a PC’s network connection.",
  "50": "RJ45 plugs are attached to cable ends with a tool called a crimper. A tone generator and probe kit is used to trace hard-to-find telecommunication and data communication cables/wires. A multimeter can be used to test the continuity of a patch cable. A cable stripper is used to strip a portion of the plastic jacket off the cable and expose the individual wires.",
  "51": "Use a punchdown tool to terminate the individual wires of a Category 6 cable to a 110 punchblock. Use a crimper to connect plugs to the ends of a cable. Use a cable stripper to remove a section of the plastic jacket of a cable. Use a tone generator to create tone at one end of a cable and then use a tone probe to find the same cable at the other end.",
  "52": "A network tap is used to intercept network traffic and make a copy of it for analysis with programs such as Wireshark. (Side note: Be sure to use a quality network tap; lesser ones will reduce your network bandwidth, which could affect everyone!) A tone and probe kit is used to trace signals on cables. A wireless analyzer (or Wi-Fi analyzer) is used to view the frequencies used in nearby wireless networks. A loopback plug is used to simulate a network connection (and test it) but can’t be used as a network tap.",
  "53": "SATA connections include a 7-pin data connector and a 15-pin power connector. VGA ports have 15 pins that are used to transmit video signal. An older IDE hard drive cable has 40 pins. Molex is a power connection that has 4 wires. Category 6 (Cat 6) cable is twisted pair cable that has 8 pins (wires).",
  "54": "STP (shielded twisted pair) is the only cable listed here that can reduce electromagnetic interference. However, fiber optic cable is another good solution, though it is more expensive and more difficult to install. Plenum-rated cable is used where fire code requires it; it doesn’t burn as fast as regular cable, and it releases fewer PVC chemicals into the air.",
  "55": "Typically, you would use USB-C to HDMI. If it is a newer Android smartphone, then chances are it will have a USB-C port. If you are attempting to connect it to a TV, HDMI is the most likely port to use. Micro-USB is used with some mobile devices, but newer devices (especially Android devices) have switched to USB-C. You wouldn’t want USB-C to DVI because TVs normally don’t have DVI inputs. USB to Ethernet helps convert from a computer or mobile device to the Ethernet network. These devices can ultimately allow a device or computer with a USB port to access the Internet. This wired connection might be favored over wireless for its speed, quality connection, and low latency.",
  "56": "A crossover cable is used to connect like devices: computer to computer or switch to switch. Straight-through cables (the more common patch cable) connect different devices (for example, connect a computer to a switch). 568B is the typical wiring standard you see in twisted pair cables; 568A is the less common standard. A crossover cable uses the 568B wiring standard on one end and 568A on the other end. (By the way, sometimes you see these standards written as T568A and T568B.) SATA is used to connect storage drives internally to desktop or laptop computers.",
  "57": "Cable Internet connections use RG-6 coaxial cable (usually) with an F-connector on the end. LC is a type of fiber optic connector. Direct burial is a type of cable that you can purchase for underground installations. RJ45 is the connector used on twisted pair patch cables. DE-9 (or DB-9) is a serial connector used with RS-232 connections.",
  "58": "Single-mode fiber is used for longer-distance runs, perhaps from one city to the next (as far as thousands of kilometers). Coaxial is common for connections between utility poles and houses/buildings. Twisted pair is common in LANs. Multimode cables have a larger core diameter than single-mode cables. Multimode is the more commonly used fiber optic cable in server rooms and for making network backbone connections between buildings in a campus.",
  "59": "A Thunderbolt connection is the best solution to the scenario—specifically, Thunderbolt version 3, which can handle 40 Gbps over USB Type-C. USB 3.2 is limited to 10 or 20 Gbps, though it also uses the USB Type-C connection. HDMI is used for video (and audio) connections. Cat 6a is a type of twisted pair cable used in Ethernet networks; it is rated for 1000 Mbps and 10 Gbps.",
  "60": "The transfer rate of DDR4-2133 is 17,066 MB/s. It is also known as PC4-17000. 19,200 MB/s is the speed of DDR4-2400 (PC4-19200). 21,333 MB/s is the speed of DDR4-2666 (PC4-21333). 25,600 MB/s is the speed of DDR4-3200 (PC4-25600).",
  "61": "The quad-channel memory architecture can allow for a 256-bit-wide bus (64-bit per channel). However, this will only be the case if all four channels have memory installed to them. ECC, which stands for error correction code, can detect and correct errors in RAM. Virtual RAM is used in smartphones to “extend” the amount of usable RAM to the phone’s long-term storage. (It is known as virtual memory in Windows.) The Task Manager is a Windows program that is used to analyze the system.",
  "62": "The answer for this question does not have an explanation.",
  "63": "The answer for this question does not have an explanation.",
  "64": "DDR5 dual-inline memory modules (DIMMs) have 288 pins and operate at 1.1 volts (V). Although DDR4 modules do have 288 pins, the architecture is different, and the voltage ranges between 1.2 and 1.35 V. DDR3 has 240 pins and common voltages of 1.2 or 1.5 V. Laptops use small-outline dual-inline memory modules (SODIMMs). Two common types of SODIMMs in laptops are DDR3 (which has 204 pins) and DDR4 (which has 260 pins).",
  "65": "The answer for this question does not have an explanation.",
  "66": "The answer for this question does not have an explanation.",
  "67": "The answer for this question does not have an explanation.",
  "68": "The answer for this question does not have an explanation.",
  "69": "The answer for this question does not have an explanation.",
  "70": "The answer for this question does not have an explanation.",
  "71": "The answer for this question does not have an explanation.",
  "72": "The answer for this question does not have an explanation.",
  "73": "The answer for this question does not have an explanation.",
  "74": "The answer for this question does not have an explanation.",
  "75": "The answer for this question does not have an explanation.",
  "76": "The answer for this question does not have an explanation.",
  "77": "The answer for this question does not have an explanation.",
  "78": "The answer for this question does not have an explanation.",
  "79": "The answer for this question does not have an explanation.",
  "80": "The answer for this question does not have an explanation.",
  "81": "The answer for this question does not have an explanation.",
  "82": "The answer for this question does not have an explanation.",
  "83": "The answer for this question does not have an explanation.",
  "84": "The answer for this question does not have an explanation.",
  "85": "The answer for this question does not have an explanation.",
  "86": "The answer for this question does not have an explanation.",
  "87": "The answer for this question does not have an explanation.",
  "88": "The answer for this question does not have an explanation.",
  "89": "The answer for this question does not have an explanation.",
  "90": "The answer for this question does not have an explanation.",
  "91": "The answer for this question does not have an explanation.",
  "92": "The answer for this question does not have an explanation.",
  "93": "The answer for this question does not have an explanation.",
  "94": "The answer for this question does not have an explanation.",
  "95": "The answer for this question does not have an explanation.",
  "96": "The answer for this question does not have an explanation.",
  "97": "The answer for this question does not have an explanation.",
  "98": "The answer for this question does not have an explanation.",
  "99": "The answer for this question does not have an explanation.",
  "100": "The answer for this question does not have an explanation.",
  "101": "The answer for this question does not have an explanation.",
  "102": "The answer for this question does not have an explanation.",
  "103": "The answer for this question does not have an explanation.",
  "104": "The answer for this question does not have an explanation.",
  "105": "The answer for this question does not have an explanation.",
  "106": "The answer for this question does not have an explanation.",
  "107": "The answer for this question does not have an explanation.",
  "108": "The answer for this question does not have an explanation.",
  "109": "The answer for this question does not have an explanation.",
  "110": "The answer for this question does not have an explanation.",
  "111": "The answer for this question does not have an explanation.",
  "112": "The answer for this question does not have an explanation.",
  "113": "The answer for this question does not have an explanation.",
  "114": "The answer for this question does not have an explanation.",
  "115": "The answer for this question does not have an explanation.",
  "116": "The answer for this question does not have an explanation.",
  "117": "The answer for this question does not have an explanation.",
  "118": "The answer for this question does not have an explanation.",
  "119": "The answer for this question does not have an explanation.",
  "120": "The answer for this question does not have an explanation.",
  "121": "The answer for this question does not have an explanation.",
  "122": "The answer for this question does not have an explanation.",
  "123": "The answer for this question does not have an explanation.",
  "124": "The answer for this question does not have an explanation.",
  "125": "The answer for this question does not have an explanation.",
  "126": "The answer for this question does not have an explanation.",
  "127": "The answer for this question does not have an explanation.",
  "128": "The answer for this question does not have an explanation.",
  "129": "The answer for this question does not have an explanation.",
  "130": "The answer for this question does not have an explanation.",
  "131": "The answer for this question does not have an explanation.",
  "132": "The answer for this question does not have an explanation.",
  "133": "The answer for this question does not have an explanation.",
  "134": "The answer for this question does not have an explanation.",
  "135": "The answer for this question does not have an explanation.",
  "136": "The answer for this question does not have an explanation.",
  "137": "The answer for this question does not have an explanation.",
  "138": "The answer for this question does not have an explanation.",
  "139": "The answer for this question does not have an explanation.",
  "140": "The answer for this question does not have an explanation.",
  "141": "The answer for this question does not have an explanation.",
  "142": "The answer for this question does not have an explanation.",
  "143": "The answer for this question does not have an explanation."
}