{
  "0": "DDR4 SODIMM modules have 260 pins. DDR3 is 204-pin. 1.8-inch is the size associated with smaller storage drives used in some laptops. 2.5-inch is the standard size for SSD storage drives.",
  "1": "The next step you should take is to reseat the memory. SODIMMs can be a bit tricky to install. They must be firmly installed, but you don’t want to press too hard and damage any components. If the laptop worked fine before the upgrade, you shouldn’t have to replace the modules or the motherboard. Windows Update will not find additional RAM.",
  "2": "It could be that the laptop is now on battery power and is set to a dimmer display and shorter sleep configuration while on battery. The laptop may not be getting AC power from the AC outlet for some reason. The battery power setting is the first thing you should check; afterward, start troubleshooting the AC adapter, cable, AC outlet, and so on. It’s too early to try replacing the display; try not to replace something until you have ruled out all other possibilities. A dim screen is not caused by OS corruption. There’s no need to plug in an external monitor; you know the video adapter is working, it’s just dim.",
  "3": "The DC jack was probably damaged when the laptop was dropped. It may have been plugged in (charging) and fallen on the plug that connects to the DC jack (which is easily damaged on many laptops). The customer probably used the laptop until the battery became discharged before noticing that the laptop wouldn’t take a charge anymore—and now it won’t turn on at all. So the battery is probably not the issue. A power adapter can be damaged, but the DC-in jack is more easily damaged. The storage drive and the BIOS/UEFI normally will not affect whether the laptop will turn on.",
  "4": "To best reduce the chance of theft, use a cable lock. This is a physical cable that can be wrapped around a sturdy object and locked to the laptop, keeping it relatively secure from theft. Incorporating biometrics means implementing a thumbprint scan or other physical characteristic scan into the authentication process. Disabling NFC means that near-field communications will be turned off, and data can’t be “beamed” to other devices. Enabling MFA means that you are implementing multi-factor authentication—for example, combining a password and biometrics. \n\nWhile none of the incorrect answers can reduce the risk of a laptop being stolen, they do decrease the chance of data being stolen. As you can guess, computer security can be incredibly deep.",
  "5": "Turning on airplane mode (the most likely cause of the problem) will disable wireless transmissions, including NFC. This is great for security purposes, but it can also disable the ability to connect to Wi-Fi networks or send/receive calls. A failed power state would render the entire device unusable; however, the question says the user was able to boot and sign on to the device. Biometric authentication is most likely not the cause of the problem in this scenario because the user is not having problems signing on to the device. Electrostatic discharge (ESD) can occur when two objects with different voltages come into contact with each other. ESD can wreak havoc with electronic components, but it is not the most likely problem here because the device appears to be working normally in all other regards—plus it’s somewhat uncommon for mobile devices. The real issue here is user error: The user did not remember that the device was in airplane mode. When you troubleshoot problems, remember that they are often user related!",
  "6": "TFT active-matrix displays are the most common in laptops that use LCDs. Passive-matrix screens have been discontinued, but you might see an older laptop that utilizes this technology. OLED technology is a newer and different technology that is not based on TFT displays but instead uses emissive display technology, meaning that each dot on the screen is illuminated by a separate diode. OLED displays can, however, be passive-matrix or active-matrix controlled. The MAC ID is the hexadecimal address associated with a network adapter, such as a Wi-Fi adapter or network card.",
  "7": "OLED (organic light-emitting diode) displays use an organic compound or film that emits light. TFT active matrix implies LCD, and neither TFT nor LCD uses organic compounds the way OLED does. In-plane switching (IPS) is a type of LCD technology that increases the available viewing angle compared to older technologies, such as twisted nematic (TN) matrix LCDs. However, IPS is generally considered inferior to OLED screens when it comes to brightness and contrast ratio when viewed from an angle. LED screens use a film and diode, but not organically in the way that OLED does, and not at such a small size.",
  "8": "A Wi-Fi card, also known as a Wi-Fi network adapter, allows you to connect to a WLAN (wireless local area network), which is essentially another name for a Wi-Fi network. LED is a type of display. A webcam is used to communicate visually and audibly with others or to record oneself. A digitizer is a device that converts tapped or written impulses on a screen into digital information that the operating system can use. A stylus is a writing device used with a digitizer or touchscreen.",
  "9": "The 2230 standard is a kind of M.2 size measuring 22×30 mm. It is common in laptops for use with Wi-Fi and Bluetooth. In comparison, a PC often uses a 2280 M.2 card. Mini PCIe is an older type of card slot that might be used for Wi-Fi cards, but it does not use measurements such as 2230 or 2280 the way that M.2 does. A digitizer is not a port at all but a device that converts tapped impulses into digital information. An RJ45 port is a networking port that allows a laptop to communicate with the rest of the network in a wired fashion—that is, if the laptop has such a port!",
  "10": "The Lightning connector is one of Apple’s proprietary charging and synchronization connectors used by iPads and iPhones, although Apple also uses USB-C. Micro-USB is used by older Android-based mobile devices, and USB-C is more common on newer Android-based devices. Thunderbolt is a high-speed hardware interface used in desktop computers, which we will discuss more in Chapter 13. IP68 deals with ingress protection against dust and water.",
  "11": "You would most likely add a microSD card (if the smartphone has a slot available for add-ons or upgrading). This is the most common method for adding long-term storage. DDR4 is a type of RAM; it is not used for adding long-term memory storage. Some smartphones use LPDDR4 as their main memory, but this is part of the system on a chip (SoC) and not accessible to the typical user. An SSD is a solid-state drive, which generally means a hard drive that is installed to a PC or laptop, connected either as SATA or M.2. SSDs are too large for smartphones and tablets. A SIM is a subscriber identity module, usually represented as a small card (mini-SIM) used in smartphones that securely stores authentication information about the user and device, such as the International Mobile Subscriber Identity (IMSI), which we will discuss more in the following chapter.",
  "12": "\"Beaming\" the information back and forth can be accomplished in a couple of ways, primarily by using near-field communication (NFC). This can only be done if the devices are in close proximity to each other. NFC is commonly used for contactless payment systems. Another potential option would be Apple’s AirDrop, but this relies on Bluetooth (for finding devices) and Wi-Fi (for transmitting data), and of course relies on using Apple-based devices. A mobile hotspot enables a smartphone or tablet to act as an Internet gateway for other mobile devices and computers. IoT stands for the Internet of Things. The question says that employees can use their mobile devices in a BYOD manner, but CYOD is a bit different. This means that employees can choose a device to use for work purposes (most likely whichever type they are more familiar with). Whether the employees can use those devices for personal purposes usually depends on company policy. IR stands for infrared, which is not commonly found on smartphones.",
  "13": "Tethering can allow a desktop computer or laptop to share the mobile device’s Internet connection. Tethering functionality can be very useful in areas where a smartphone has cellular access but a PC/laptop cannot connect to the Internet. Mobile device accessories such as headsets, speakers, game pads, extra battery packs, and protective covers are useful, but they are not used to connect to the Internet. IP codes (for example, IP68) are used to classify and rate the degree of protection against dust and water.",
  "14": "The best option is to set up a touch pen to access the smartphone’s screen directly. A smartphone may come with a touch pen (also known as a stylus pen or simply a stylus); or it may be able to have a touch pen added later. A touch pen enables a person to input information to the screen more accurately. The other devices listed will make mobility more difficult (if not impossible). The next best answer would be an external touchpad, but it isn’t the easiest solution. If the user finds that she needs the touchpad more often, then a better, more permanent solution might be to use a tablet computer instead of a smartphone.",
  "15": "This feature is coming soon",
  "16": "This feature is coming soon",
  "17": "This feature is coming soon",
  "18": "This feature is coming soon",
  "19": "This feature is coming soon",
  "20": "This feature is coming soon",
  "21": "This feature is coming soon",
  "22": "This feature is coming soon",
  "23": "This feature is coming soon",
  "24": "This feature is coming soon",
  "25": "This feature is coming soon",
  "26": "This feature is coming soon",
  "27": "This feature is coming soon",
  "28": "This feature is coming soon",
  "29": "This feature is coming soon",
  "30": "This feature is coming soon",
  "31": "This feature is coming soon",
  "32": "This feature is coming soon",
  "33": "This feature is coming soon",
  "34": "This feature is coming soon",
  "35": "This feature is coming soon",
  "36": "This feature is coming soon",
  "37": "This feature is coming soon",
  "38": "This feature is coming soon",
  "39": "This feature is coming soon",
  "40": "This feature is coming soon",
  "41": "This feature is coming soon",
  "42": "This feature is coming soon",
  "43": "This feature is coming soon",
  "44": "This feature is coming soon",
  "45": "This feature is coming soon",
  "46": "This feature is coming soon",
  "47": "This feature is coming soon",
  "48": "This feature is coming soon",
  "49": "This feature is coming soon",
  "50": "This feature is coming soon",
  "51": "This feature is coming soon",
  "52": "This feature is coming soon",
  "53": "This feature is coming soon",
  "54": "This feature is coming soon",
  "55": "This feature is coming soon",
  "56": "This feature is coming soon",
  "57": "This feature is coming soon",
  "58": "This feature is coming soon",
  "59": "This feature is coming soon",
  "60": "This feature is coming soon",
  "61": "This feature is coming soon",
  "62": "This feature is coming soon",
  "63": "This feature is coming soon",
  "64": "This feature is coming soon",
  "65": "This feature is coming soon",
  "66": "This feature is coming soon",
  "67": "This feature is coming soon",
  "68": "This feature is coming soon",
  "69": "This feature is coming soon",
  "70": "This feature is coming soon",
  "71": "This feature is coming soon",
  "72": "This feature is coming soon",
  "73": "This feature is coming soon",
  "74": "This feature is coming soon",
  "75": "This feature is coming soon",
  "76": "This feature is coming soon",
  "77": "This feature is coming soon",
  "78": "This feature is coming soon",
  "79": "This feature is coming soon",
  "80": "This feature is coming soon",
  "81": "This feature is coming soon",
  "82": "This feature is coming soon",
  "83": "This feature is coming soon",
  "84": "This feature is coming soon",
  "85": "This feature is coming soon",
  "86": "This feature is coming soon",
  "87": "This feature is coming soon",
  "88": "This feature is coming soon",
  "89": "This feature is coming soon",
  "90": "This feature is coming soon",
  "91": "This feature is coming soon",
  "92": "This feature is coming soon",
  "93": "This feature is coming soon",
  "94": "This feature is coming soon",
  "95": "This feature is coming soon",
  "96": "This feature is coming soon",
  "97": "This feature is coming soon",
  "98": "This feature is coming soon",
  "99": "This feature is coming soon",
  "100": "This feature is coming soon",
  "101": "This feature is coming soon",
  "102": "This feature is coming soon",
  "103": "This feature is coming soon",
  "104": "This feature is coming soon",
  "105": "This feature is coming soon",
  "106": "This feature is coming soon",
  "107": "This feature is coming soon",
  "108": "This feature is coming soon",
  "109": "This feature is coming soon",
  "110": "This feature is coming soon",
  "111": "This feature is coming soon",
  "112": "This feature is coming soon",
  "113": "This feature is coming soon",
  "114": "This feature is coming soon",
  "115": "This feature is coming soon",
  "116": "This feature is coming soon",
  "117": "This feature is coming soon",
  "118": "This feature is coming soon",
  "119": "This feature is coming soon",
  "120": "This feature is coming soon",
  "121": "This feature is coming soon",
  "122": "This feature is coming soon",
  "123": "This feature is coming soon",
  "124": "This feature is coming soon",
  "125": "This feature is coming soon",
  "126": "This feature is coming soon",
  "127": "This feature is coming soon",
  "128": "This feature is coming soon",
  "129": "This feature is coming soon",
  "130": "This feature is coming soon",
  "131": "This feature is coming soon",
  "132": "This feature is coming soon",
  "133": "This feature is coming soon",
  "134": "This feature is coming soon",
  "135": "This feature is coming soon",
  "136": "This feature is coming soon",
  "137": "This feature is coming soon",
  "138": "This feature is coming soon",
  "139": "This feature is coming soon",
  "140": "This feature is coming soon",
  "141": "This feature is coming soon",
  "142": "This feature is coming soon",
  "143": "This feature is coming soon"
}