{
    "0": "Objective 1.1 concentrates on Windows 10 editions, feature differences, and upgrade paths.",
    "1": "Windows 10 editions RAM limits: Home = 128 GB, Pro = 2 TB, Pro for Workstations/ Enterprise = 6 TB.",
    "2": "Note: Regardless of what edition you run, it’s important to make sure that your system has the resources required to run Windows. For example, on a 64-bit system, the Windows 10 minimum requirements include 1 GHz CPU, 2 GB of RAM, and 20 GB of free storage space (32 GB for virtual machines).",
    "3": "Be able to identify Windows 10’s icons, Start button, Start menu, taskbar, search tool, pinned applications, and notification area.",
    "4": "Objective 1.2 focuses on navigational commands such as cd, dir, md, and rmdir; as well as command-line tools such as chkdsk, sfc, format, and robocopy.",
    "5": "Note: In Windows 11, right-clicking on the Start button shows Terminal instead of Command Prompt by default.",
    "6": "Know how to open PowerShell from the Search tool, from the Start menu, and from the Run prompt.",
    "7": "Note: Administrators who write scripts often are likely to use Visual Studio Code (known as VSC or VSCode). This is an integrated development environment (IDE) that can be used to build PowerShell scripts and scripts in other programming languages (such as Python). It has a built-in command line as well—often defaulting to PowerShell— that you can use to test your scripts. It’s free and open source as of the writing of this book. Also, it’s cross-platform—meaning you can run it on other systems as well, such as Linux. I highly suggest checking it out: https://code.visualstudio.com.",
    "8": "Note: As a reminder, directory is the original name for folder. The more accurate names are directory when working in any command line and folder when working in the GUI, but the two terms are sometimes used interchangeably.",
    "9": "note: The older versions of md and rd are mkdir and rmdir, respectively.",
    "10": "Know how to use the cd, cd .., and cd \\ commands in PowerShell or the Command Prompt.",
    "11": "Note: You can create a file such as test.txt within Notepad, which is available via the Search tool or by going to Run and typing notepad. Notepad is the default graphical text editor in Windows, and you can use it for editing text files and scripts. However, you might opt to use another editor, especially if you plan on doing any scripting or coding. (Some alternatives include Notepad++, Sublime Text, Atom, and my favorite—though it is not graphical—Vim.)",
    "12": "Understand how to use dir, copy, xcopy, and robocopy for the exam.",
    "13": "Note: %systemroot% is the folder where Windows was installed; by default, it is C:\\Windows.",
    "14": "Know the basic switches for chkdsk and sfc, such as chkdsk /F and sfc /scannow.",
    "15": "To view additional IP configuration information, such as DNS servers and MAC addresses, use the ipconfig /all command.",
    "16": "Note: The ipconfig command (and most other commands, for that matter) can also be run from the Search tool or the Run prompt. Just open one of these tools and type cmd /k ipconfig to open up a shell and display the results of the command.",
    "17": "Note: Another way to flush the DNS cache is to issue the command netsh int ip in PowerShell. But beware: This completely resets the TCP/IP connection for the network adapter.",
    "18": "Note: Latency is the time it takes for sent data packets to be received by a remote computer. Latency increases with distance, type of network connection used, and network congestion. For example, a ping to a computer on the LAN should have very low latency—perhaps less than 1 millisecond (ms). But a ping initiated from a computer in New York City to a computer in Los Angeles over a cable Internet connection might have a latency of 25 ms. This can be a very enlightening piece of the ping results.",
    "19": "Note: You can also use the ping loopback and ping localhost commands, adding -4 for IPv4 and -6 for IPv6. However, for testing, pinging the IP address is usually recommended.",
    "20": "Know how to ping the local loopback IPv4 and IPv6 addresses.",
    "21": "Know how to use the -t, -n, -l, -a, -4, and -6 options with ping.",
    "22": "Be able to recognize the output of a tracert command!",
    "23": "Know how and why to use the net use command!",
    "24": "This portion of Objective 1.3 concentrates on the Task Manager and the MMC (and administrative tools).",
    "25": "Understand how to open the Task Manager, how to read its Performance tab, and how to end processes and applications.",
    "26": "Note: Work with the Task Manager on your system and get to know the program. You will be using it often.",
    "27": "Note: You will learn quickly that administrative functions should be carried out only by users who have administrative privileges. Even if you have administrative privileges, a pop-up User Account Control (UAC) window appears every time you try to access tools such as the MMC. Simply click Yes or Continue to open the program. Users who don’t have administrative capabilities will either be blocked altogether or won’t be able to continue when the UAC window pops up.",
    "28": "Note: The extension .msc is used for a Microsoft Management console snap-in control file, also known as a Microsoft console window. As mentioned, this and many of the other tools we’ll discuss in this chapter can be added to the MMC as snap-ins. I recommend that you add them to your MMC so that you can get to them easily while you are studying.",
    "29": "Be able to describe the Event Viewer’s System, Application, and Security log files as well as the information, warning, error, and audit success events.",
    "30": "Know how to access the properties of a device, install drivers, and enable/disable devices in the Device Manager.",
    "31": "Note: Other tools that can be used to track resource usage include the Resource Monitor (Run > resmon.exe) and the Performance tab of the Task Manager, though these are not as thorough as Performance Monitor, nor do they have the ability to save the tracked resource usage.",
    "32": "Note: If you want to add the Group Policy Editor to your MMC, go to File > Add/Remove Snap-in, and then click Group Policy Object Editor and click Add. For the Group Policy Object, you will see Local Computer. Leave that as is and click Finish.",
    "33": "Note: This chapter does not cover all of the administrative tools yet, but you will learn about more of them as you progress through the book.",
    "34": "This portion of Objective 1.3 concentrates on Disk Management and additional tools (such as Resource Monitor, System Configuration, and Regedit).",
    "35": "Note: WARNING: ALL DATA WILL BE ERASED during the format procedure.",
    "36": "There is, technically, a difference between a partition and a volume. A partition is a logical division of a drive. A volume is any space among one or more drives that receives a drive letter.",
    "37": "Know how to access the Optimize Drives/Disk Defragmenter utility in Windows and know the defrag command in the Command Prompt.",
    "38": "Be able to open MSConfig and identify what each of the tabs is used for.",
    "39": "Objective 1.4 concentrates on the following Control Panel utilities: Internet Options, Devices and Printers, Programs and Features, Network and Sharing Center, System, Windows Defender Firewall, Mail, Sound, User Accounts, Device Manager, Indexing Options, Administrative Tools, File Explorer Options, Power Options, and Ease of Access.",
    "40": "The CompTIA A+ exams expect you to know the individual icons in the Control Panel. In Windows, this is also referred to as All Control Panel Items. Study them!",
    "41": "Note: To configure settings in the newer Edge browser, open the browser and type edge://settings in the address bar.",
    "42": "Know how to access Programs and Features to uninstall programs or turn Windows features on or off.",
    "43": "Know how to use the Program Compatibility utility and the Compatibility tab in a program’s Properties window. Understand that Compatibility mode can be helpful if a system has undergone an upgrade but the running program might be a security risk.",
    "44": "Note: Opening the System icon in the Control Panel automatically redirects to Settings. We’ll cover this further in Chapter 36.",
    "45": "Know how to enable and disable audio devices in the Playback and Recording tabs of the Sound dialog box.",
    "46": "Know the differences between standby, sleep, and hibernate and understand how to set up hibernation in Windows.",
    "47": "Objective 1.5 concentrates on the following Windows settings: Time & Language, Update & Security, Personalization, Apps, Privacy, System, Devices, Network & Internet, Gaming, and Accounts.",
    "48": "Know how to run and troubleshoot Windows Update.",
    "49": "Know where and how to modify display resolution and scaling in Settings.",
    "50": "Note: Color depth is different from color space. This refers to the number of colors that the Windows desktop uses. In the old days, you could have 8-bit color, 16-bit color, and other options. However, in Windows 10/11, the default option is 32-bit, which means 4,294,967,296 colors. Because of this, you might have difficulty displaying older programs properly. With older programs, you can use the Program Compatibility tool (discussed in Chapter 35) to run the programs at a lower color depth. You might also accomplish this within the Advanced Display settings or by using a virtual machine.",
    "51": "Know the tabs of the System Properties dialog box.",
    "52": "Know where to configure virtual memory and know the location of pagefile.sys.",
    "53": "Objective 1.6 focuses on workgroup vs. domain setup, local OS firewall settings, client network configuration, establishing network connections, proxy settings, public networks vs. private networks, File Explorer navigation and network paths, and metered connections and limitations.",
    "54": "Be able to define the differences between a workgroup and a domain and know where to change from one to the other (System Properties dialog box > Computer Name tab).",
    "55": "Note: Some companies with small networks avoid Windows sharing altogether and instead install a network-attached storage (NAS) device that also has print server capabilities.",
    "56": "Know how to map network drives in the GUI and at the command line.",
    "57": "Know how to connect (map) to a network printer by printer share name or IP address.",
    "58": "Know how to navigate to and configure the proxy settings in Windows!",
    "59": "Side fact: Generally, when people use the term x86, they refer to 32-bit CPUs that enable 4 GB of address space",
    "60": "Side fact: 64-bit CPUs can run 64-bit and 32-bit software.",
    "61": "Objective 1.7 focuses on system requirements for applications, OS requirements for applications, distribution methods, and other considerations for new applications.",
    "62": "Know the differences between 32-bit and 64-bit architectures. For example, remember that 32-bit CPUs can only address a maximum of 4 GB of RAM, and 64-bit CPUs can address many terabytes of RAM.",
    "63": "Know the locations for 64-bit and 32-bit system files and program files in Windows.",
    "64": "Understand minimum requirements categories for software, including CPU, RAM, GPU (and VRAM), storage space, and OS type and edition.",
    "65": "An ISO image (.iso file) is a single file that represents a complete set of files that would be placed on an optical disc. It’s commonly used for operating systems and large applications.",
    "66": "Objective 1.8 focuses on workstation operating systems, cell phone/tablet operating systems, various file system types, vendor life-cycle limitations, and compatibility concerns between operating systems.",
    "67": "Understand the difference between open source and closed source.",
    "68": "Know the differences between NTFS, FAT32, and exFAT.",
    "69": "Remember that a software version has an end-of-support date, also known as an end-of-life date. Be ready to have an upgrade plan well before that date!",
    "70": "Objective 1.9 focuses on boot methods, types of installations, partitioning, drive format, upgrade considerations, and feature updates.",
    "71": "Book fact: There are free programs available that can speed up the process by making the drive bootable, formatting it, and extracting the .ISO all at once (for instance, Rufus, Yumi, and the Windows USB/DVD Download Tool).",
    "72": "Note: By the way, when you sit at a computer and answer all the questions it asks you, step-by-step, it is known as an attended installation; you are attending to the computer as the installation progresses.",
    "73": "Know these boot methods for OS installation and upgrades: optical disc, external/flash drive, network boot (PXE), internal drive, and Internet based.",
    "74": "Know the difference between local, network, drive image, and recovery partition installations.",
    "75": "Know the differences between basic and dynamic drives.",
    "76": "Know the differences between GPT and MBR! GPT is newer and better, has 128 partitions, and can go far beyond the 2 TB MBR maximum partition size.",
    "77": "Know how to use the Disk Management and diskpart utilities!",
    "78": "Objective 1.10 focuses on macOS: the installation and uninstallation of applications, Apple ID and corporate restrictions, best practices, system preferences, features, Disk Utility, FileVault, Terminal, and Force Quit.",
    "80": "macOS is closed source and is based on BSD (Unix).",
    "81": "Use the Dock to open common applications and switch between running apps.",
    "82": "Understand what the Finder and Spotlight programs are in macOS.",
    "83": "Know how to configure multiple desktops, Screen Sharing, and the replication of the display to a secondary monitor.",
    "84": "Consider configuring the Keychain utility to save passwords to an iCloud account. This will enable password population even if a user switches to a replacement macOS device.",
    "85": "Know how to use the Time Machine, Disk Utility, and Force Quit tools in macOS.",
    "86": "Know the differences between .dmg, .app, and .pkg. For example, you can’t install from a .dmg file on Windows because that file type is not compatible with Windows; it is designed for macOS.",
    "87": "Objective 1.11 focuses on Linux: common commands, best practices, and tools.",
    "88": "Note: For practice with Ubuntu, consider creating an Ubuntu bootable USB stick within Windows; see https://ubuntu.com/tutorials/create-a-usb-stick-on-windows#1-overview. An Ubuntu bootable USB stick enables you to boot Linux from the flash drive and practice Linux commands using the built-in Terminal application. You might also consider downloading the latest version of Ubuntu and installing it on a virtual machine. Or, if you are using Windows, consider using the Windows Subsystem for Linux (WSL). Ubuntu Desktop can be downloaded from https://www.ubuntu.com/download/desktop.",
    "89": "Most Linux systems use the ext4 file system and GPT by default.",
    "90": "Know your Linux commands! Practice them on a distribution such as Ubuntu or Fedora.",
    "91": "Understand how to update Linux systems with apt update and apt upgrade or dnf update.",
    "92": "This portion of Objective 2.1 concentrates on physical security and physical security for staff.",
    "93": "An access control vestibule (mantrap) is used to stop and monitor people during the identification process.",
    "94": "This portion of Objective 2.1 concentrates on the following: logical security, mobile device management (MDM), and Active Directory.",
    "95": "When two or more authentication factors are combined, such as a password and a physical token, the result is multi-factor authentication (MFA).",
    "96": "Know that a domain is Microsoft’s implementation of a client/server network. It centralizes the management of users and computers.",
    "97": "Know how to access and configure the Group Policy Editor (gpedit.msc) and the Local Security Policy (secpol.msc).",
    "98": "An authenticator app uses a passcode to achieve two-step verification.",
    "99": "Protect email communications with encryption, digital signatures, secure ports, VPNs, and, especially, updates, and user education.",
    "100": "It’s important to prevent spam email. Some methods include using spam filters, strong passwords, allow and deny lists, and user education!",
    "101": "Objective 2.2 concentrates on the following: protocols and encryption (WPA2, WPA3, TKIP, and AES) and authentication (RADIUS, TACACS+, Kerberos).",
    "102": "Know the differences between WPA2, WPA3, TKIP, and AES.",
    "103": "RADIUS servers can be used to provide secure SSO access for Wi-Fi and network resources.",
    "104": "Know how to connect a wireless client to a RADIUS server using WPA2-Enterprise and port 1812.",
    "105": "Note: 802.1X is an IEEE standard that defines port-based network access control (PNAC). Not to be confused with 802.11x WLAN standards, 802.1X is an authentication technology used to connect hosts to a LAN or WLAN. 802.1X allows you to apply a security control that ties physical ports to end-device MAC addresses and prevents additional devices from being connected to the network. It is a good way of implementing port security—better than simply setting up MAC address filtering.",
    "106": "Fact: Whereas RADIUS uses UDP as its transport layer protocol, TACACS+ uses TCP as its transport layer protocol, and TCP is usually seen as a more reliable transport protocol than UDP (though each has its own unique set of advantages)",
    "107": "RADIUS uses port 1812 and UDP. TACACS+ uses port 49 and TCP.",
    "108": "Note: Authentication, authorization, and accounting are collectively known as AAA. RADIUS and TACACS+ servers are often referred to as AAA servers.",
    "109": "Kerberos is an authentication protocol designed at MIT that enables computers to prove their identity to each other in a secure manner.",
    "110": "A common implementation of Kerberos occurs when a user logs on to a Microsoft domain.",
    "111": "Fact: Know this: Active Directory is the most commonly used directory services solution, but it’s not the only game in town. Kerberos can be used with any directory services solution, including the open source FreeIPA and its cousin Red Hat Identity Management. However, the A+ exam will most likely focus on Active Directory.",
    "112": "Kerberos uses mutual authentication to provide security for clients attempting to connect to Active Directory domain controllers. It uses inbound port 88.",
    "113": "Objective 2.4 concentrates on the following: social engineering (such as phishing and shoulder surfing), threats (such as DDoS and zero-day attacks), and vulnerabilities (such as unpatched systems and EOL systems).",
    "114": "Use a screen filter to protect against shoulder surfing.",
    "115": "In a DDoS attack, multiple systems are used to attack a server, website, or network.",
    "116": "Know the differences between dictionary and brute-force attacks and understand how rainbow tables are used.",
    "117": "A cryptanalysis attack uses a considerable set of precalculated encrypted passwords located in a lookup table. Such a table is known as a rainbow table, and this type of password attack uses a precomputation, where all words in the dictionary (or a specific set of possible passwords) are hashed and stored. The goal of a cryptanalysis attack is to recover passwords more quickly. This type of attack can be defeated by implementing salting, which is the randomization of the hashing process. It usually incorporates key stretching, which means adding bits of information to a password to make it stronger.",
    "118": "Objective 2.5 focuses on Defender Antivirus, Defender Firewall, users and groups, local OS options, NTFS vs. share permissions, Run as administrator vs. standard user, BitLocker, BitLocker To Go, and Encrypting File System (EFS).",
    "119": "Know the Windows user accounts and groups, including Administrator, Power User, Guest, and Standard User. Know what they can and cannot do!",
    "120": "NTFS permissions are modified in the Security tab of the folder’s Properties window.",
    "121": "Note: Keep in mind that when you move data within a partition, the data isn’t actually relocated; instead, the pointer to the file or folder is modified.",
    "122": "To view files such as bootmgr, pagefile.sys, and hiberfil.sys, select the Show hidden files radio button and deselect the Hide protected operating system files checkbox.",
    "123": "Hidden/administrative shares can be identified by the $ on the end of the share name.",
    "124": "Know the components necessary for BitLocker: a TPM or USB key.",
    "125": "Side fact: A few different encryption technologies are used in Windows. For example, whenever you log on to a Windows network, that authentication is secured with the Kerberos protocol. As another example, when you want to encrypt one or more files or folders, Windows uses Encrypting File System (EFS), a component of NTFS. Follow these steps to encrypt a file in Windows:",
    "126": "Objective 2.6 concentrates on data-at-rest encryption, password best practices, end-user best practices, account management, changing the default administrator’s user account/password, and disabling AutoRun/AutoPlay.",
    "127": "Understand what is required for a strong complex password.",
    "128": "Know how to enable/disable accounts, reset passwords, and modify password policy!",
    "129": "The difference between locking and logging out is that a locked computer leaves all the session’s applications and files open; logging out closes all open applications and files.",
    "130": "Know how to disable AutoPlay in Windows Settings and the Group Policy Editor."
}