{
  "Which edition of Windows 10 has the following characteristics?: \nRam Limitation: 128 GB (x64) 4 GB (x86)\nPhysical CPU Support: 1\nRemote Desktop Protocol (client only)\nDomain Access: NO\nEFS and bitlocker: NO\nHyper-V: NO\nGroup Policy Editor (gpedit.msc): NO": "Windows 10 Home",
  "Which edition of Windows 10 has the following characteristics?: \nRam Limitation: 2 TB (x64) 4 GB (x86)\nPhysical CPU Support: 2\nRemote Desktop Protocol (client and server)\nDomain Access: YES\nEFS and bitlocker: YES\nHyper-V: YES\nGroup Policy Editor (gpedit.msc): YES": "Windows 10 Pro",
  "Which edition of Windows 10 has the following characteristics?: \nRam Limitation: 6 TB (x64) 4 GB (x86)\nPhysical CPU Support: 4\nRemote Desktop Protocol (client and server)\nDomain Access: YES\nEFS and bitlocker: YES\nHyper-V: YES\nGroup Policy Editor (gpedit.msc): YES": "Windows 10 Pro for Workstations and Windows 10 Enterprise",
  "_____ are the little clickable pictures you see on the desktop.": "Icons",
  "This is the main menu that is launched from the Start button.": "Start Menu",
  "This bar spans the bottom of the desktop. It houses the Start button, Quick Launch, any open applications, and the notification area (where applicable).": "Taskbar",
  "To the far right of the taskbar is the ____________ ____, which houses the clock, volume control, network icon, battery power indicator, and so on.": "notification area",
  "Enter the Windows command that executes the following action: enables you to move from one directory to another.": "cd",
  "Enter the Windows command that executes the following action: create directories.": "md",
  "Enter the Windows command that executes the following action: enables you to remove directories.": "rd",
  "Enter the Windows command that executes the following action: moves you up one directory.": "cd ..",
  "Enter the Windows command that executes the following action: takes you directly to the top (root) of the volume that you are working in.": "cd \\",
  "Enter the Windows command that executes the following action: find out what volumes you have on your system.": "wmic logicaldisk get name",
  "Enter the Windows command that executes the following action: when used alone, it displays the contents of the current directory. But it can be configured to show information in any other directory.": "dir",
  "Enter the Windows command that executes the following action: shows all the directories and subdirectories at your current position. Be careful where you run this command because it could list information for quite a while and cause some stress on the storage drive.": "tree",
  "Enter the Windows command that executes the following action: allows you to copy one or more files to another location.": "copy",
  "Enter the Windows command that executes the following action: meant to copy large amounts of data from one location to another; it even makes exact copies of entire directory trees.": "xcopy",
  "Enter the Windows command that executes the following action: meant to copy directories that contain lots of data, and it can even mirror complete directory trees from one computer to another. This is the successor to xcopy.": "robocopy",
  "Enter the Windows command that executes the following action: when you are done with a file and are ready to delete it.": "del",
  "Enter the Windows command that executes the following action: this utility is the command-line counterpart of the Windows Disk Management program.": "diskpart",
  "Enter the Windows command that executes the following action: you use this command to format storage media to a particular file system, such as NTFS, FAT, or FAT32.": "format",
  "Enter the Windows command that executes the following action: this is the command-line version of Disk Defragmenter.": "defrag",
  "Enter the Windows command that executes the following action: to analyze a drive.": "defrag -a",
  "Enter the Windows command that executes the following action: checks a drive, fixes basic issues like lost files, and displays a status report; it can also fix some errors on the drive with the addition of the /F switch.": "chkdsk",
  "Enter the Windows command that executes the following action: scans all protected files immediately and repairs files.": "sfc /scannow",
  "Enter the Windows command that executes the following action: scans the integrity of files but does not perform a repair.": "sfc /verifyonly",
  "Enter the Windows command that executes the following action: fixes errors on a drive.": "chkdsk /F",
  "Enter the Windows command that executes the following action: brings up a window that tells you what operating system you are running, the edition, and the build number.": "winver",
  "Enter the Windows command that executes the following action: displays the Windows version.": "ver",
  "Enter the Windows command that executes the following action: used to turn off a computer, restart it, send it to hibernate mode, log a person off, and so on.": "shutdown",
  "Enter the Windows command that executes the following action: used to turn off a computer (enter the correct the flag for the standard operation).": "shutdown /s",
  "Enter the Windows command that executes the following action: updates multiple Group Policy settings.": "gpupdate",
  "Enter the Windows command that executes the following action: displays the Resultant Set of Policy (RSoP) information for a target user and computer.": "gpresult",
  "Command-line utility for Windows servers and workstations that displays the current TCP/IP configuration of the machine. Similar to ip in Linux.": "ipconfig",
  "This command releases the current IP address.": "ipconfig /release",
  "This command renews the IP address after being released.": "ipconfig /renew",
  "If you're havizng DNS issues (for example, problems connecting to websites), you can erase the DNS cache by typing what?": "ipconfig /flushdns",
  "_______ is the time it takes for sent data packets to be received by a remote computer.": "latency",
  "____ tests whether another host is available over the network. Using this command is an easy way to see if another host is \"alive\". It can also be used to spot DNS issues, latency problems, and to test whether a computer has TCP/IP installed properly, even if it isn't wired to the network.": "ping",
  "Enter the Windows command that pings the host until the command is stopped (e.g., by Ctrl + C).": "ping -t",
  "Enter the Windows command that pings a host a specific number of times.": "ping -n",
  "Enter the Windows command that pings 192.168.0.1 20 times.": "ping -n 20 192.168.0.1",
  "Enter the Windows command that pings the host such that you are able to specify the number of bytes per packet to be sent.": "ping -l",
  "Enter the Windows command that pings 192.168.0.1 packets the size of 1500.": "ping -l 1500 192.168.0.1",
  "Enter the ping command that resolves address to hostnames.": "ping -a",
  "Enter the ping command that forces the use of IPv4 and results in IPv4-based data, when pinging.": "ping -4",
  "Enter the ping command that forces the use of IPv6 and results in IPv6-based data, when pinging.": "ping -6",
  "Enter the ping command that sends 450 pings, each 1500 bytes in size, to 192.168.0.1": "ping -n 450 -l 1500 192.168.0.1",
  "You can also use ___ to test whether a computer has TCP/IP installed properly, even if it isn’t wired to the network! To do this, use the ___ 127.0.0.1 command for IPv4 and ___ ::1 for IPv6.": "ping",
  "::1 and 127.0.0.1 are known as ________ _________": "loopback addresses",
  "________ queries DNS servers to discover DNS details, including the IP addresses of hosts. For example, to find the IP address of example.com, you would type ________ example.com.": "nslookup",
  "nslookup means ____ ______ ______": "name server lookup",
  "Loopback ____ commands essentially enable you to ____ yourself, meaning you can test the local computer’s network connection without a valid IP configuration and without a physical connection to the network.": "ping",
  "Windows command-line utility used to follow the path a packet takes between two hosts. The utility is traceroute in macOS and Linux.": "tracert",
  "Command-line tool in Windows and Linux to identify inbound and outbound TCP/IP connections with the host.": "netstat",
  "Command-line program in Windows used to determine exactly what information the DNS server is providing about a specific host name.": "nslookup",
  "Command-line utility in Windows that enables users to view and change a whole host of network settings and information.": "net",
  "Enter the Windows command to create an account.": "net user /add",
  "Enter the [PowerShell] command to learn what volumes are available on a system.": "get-volume",
  "Enter the Windows command that starts the Device Manager (using the Run prompt / command line / PowerShell).": "devmgmt.msc",
  "A _________ is a logical division of a drive. A volume is any space among one or more drives that receives a drive letter.": "partition",
  "A partition is a logical division of a drive. A ______ is any space among one or more drives that receives a drive letter.": "volume",
  "A _______ drive is a drive that is mapped to an empty folder within a volume that has been formatted as NTFS.": "mounted",
  "Which registry hive fits the following description: Stores information about applications’ file associations and Object Linking and Embedding (OLE).": "HKEY_CLASSES_ROOT",
  "Which registry hive fits the following description: Stores settings that concern the currently logged-on user. It is common to make changes in this hive.": "HKEY_CURRENT_USER",
  "Which registry hive fits the following description: Stores hardware and software settings that are specific to the computer. This is where the bulk of a PC technician’s registry edits are made. One example of data stored here is the programs that run when the OS starts.": "HKEY_LOCAL_MACHINE",
  "Which registry hive fits the following description: Stores data corresponding to all users who have ever logged on to the computer.": "HKEY_USERS",
  "Which registry hive fits the following description: Contains information that is gathered every time the computer starts up.": "HKEY_CURRENT_CONFIG",
  "Hives are also known as ____, and they contain other ____ and sub____.": "keys",
  "The registry does not store actual data files; it stores ________.": "settings",
  "Enter the PowerShell command (when in elevated mode) to turn on the Hibernate mode.": "powercfg.exe /hibernate on",
  "The ____ __ ______ ______ on Windows 10 allows a user to turn on a variety of tools: the magnifier to view small objects more easily, the narrator for voice prompts while working in Windows, the onscreen keyboard, and high contrast.": "Ease of Access Center",
  "Enter the Windows command to view the name of the device.": "hostname",
  "Enter the copy command that verifies that new files are written correctly.": "copy /v",
  "Enter the copy command that suppresses prompting to confirm you want to overwrite an existing destination file.": "copy /y",
  "_______ ___________ is the number of pixels (or picture elements) on a screen. It is measured horizontally by vertically (HxV).": "Display Resolution",
  "_______ ____ is the number of times a display is “painted” per second.": "Refresh rate",
  "_____ _____ in Windows refers to the dynamic range of color intensity and luminance and how colors are represented on the display.": "Color space",
  "Enter the PowerShell command (when in elevated mode) to have Windows convert the Windows Update log files into a readable manner (which will be sent to your desktop).": "Get-WindowsUpdateLog",
  "What protocol does ping use?": "ICMP",
  "What does ICMP stand for?": "Internet Control Message Protocol",
  "In the context of Windows networking, _________, (sometimes also referred to as peer-to-peer) is usually a small group of computers that share the same network name. No single computer controls the network, and all systems are considered equal. One of the disadvantages is that a computer storing data can be accessed only by a maximum of 20 other systems simultaneously.": "workgroup",
  "In the context of Windows networking, A ______ (sometimes also referred to as a client/server network) builds on the idea of a workgroup by having one or more computers (servers) that are in control of the network. This enables more computers, more simultaneous access, and centralized administration. A ______ also gets a name, such as dprocomputer.com.": "domain",
  "A domain is controlled by a Microsoft server known as a ______ __________.": "domain controller",
  "Some organizations use _____ _______ to cache HTTPS, FTP, and other information.": "proxy servers",
  "The __-bit system files and apps are stored in C:\\Windows\\System32": "64",
  "The __-bit system files and apps are stored in C:\\Windows\\SysWOW64.": "32",
  "__-bit programs are stored in C:\\Program Files": "64",
  "__-bit programs are stored in C:\\Program Files (x86)": "32",
  "___ is a distributed file system that allows a client computer to access files over the network.": "NFS",
  "Within the context of file systems, what does NFS stand for?": "Network File System",
  "What is the default location of the Spool folder in Windows?": "%systemroot%\\System32\\Spool\\Printers",
  "The concept of ____ _____ is one that many organizations have been adopting over the past decade. Essentially, it means that the organization accepts the fact that attacks could come from inside or outside and that no system is 100% secure.": "zero trust",
  "What is the Linux command that fits the following description: Lists directory contents. Similar to dir in Windows.": "ls",
  "What is the Linux command that fits the following description: Changes the directory.": "cd",
  "What is the Linux command that fits the following description: Displays the full path/filename of the working directory. Don’t confuse this command with passwd!": "pwd",
  "What is the Linux command that fits the following description: Moves (or renames) files. Similar to the Windows move command.": "mv",
  "What is the Linux command that fits the following description: Copies files and directories. Similar to the Windows copy command.": "cp",
  "What is the Linux command that fits the following description: Removes files or directories. Similar to the Windows del and rd commands.": "rm",
  "What is the Linux command that fits the following description: Searches for files (or directories) in a directory hierarchy.": "find",
  "What is the Linux command that fits the following description: Displays the contents of text files (and configuration files) within Terminal.": "cat",
  "What is the Linux command that fits the following description: Reports file system disk space usage. The command __ -T includes the file system used by each partition.": "df",
  "What is the Linux command that fits the following description: Modifies the read and write permissions for a file or directory.": "chmod",
  "What is the Linux command that fits the following description: Changes ownership for files and directories.": "chown",
  "What is the Linux command that fits the following description: Displays information about a process/list running processes.": "ps",
  "What is the Linux command that fits the following description: Lets you run the shell/Terminal session as another user (root or any other user). Originally short for superuser, it is also used to mean substitute user.": "su",
  "What is the Linux command that fits the following description: Allows a user to execute a single command as another user (such as a root). By default, a user with ____ privileges can do anything on the system.": "sudo",
  "What is the Linux command that fits the following description: Used to update a user’s password.": "passwd",
  "What is the Linux command that fits the following description: A group of commands, including ip address, ip link, ip route, and so on. For example, typing the ip address command (ip a for short) shows the TCP/IP properties of all network connections. An example of this is shown after this table.": "ip",
  "What is the Linux command that fits the following description: Shows the TCP/IP properties of the wireless network connections and can be used to configure them.": "iwconfig",
  "What is the Linux command that fits the following description: Used to find information about DNS.": "dig",
  "What is the Linux command that fits the following description: An analysis program that displays the running Linux processes and the CPU and RAM usage for each.": "top",
  "What is the Linux command that fits the following description: A text editor that can be run from Terminal. Included in most versions of Linux.": "nano",
  "RADIUS uses port ____ and UDP.": "1812",
  "RADIUS uses port 1812 and ___.": "UDP",
  "TACACS+ uses port __ and the TCP protocol.": "49",
  "TACACS+ uses port 49 and the ___ protocol.": "TCP",
  "Note: ______________, _____________, and __________ are collectively known as AAA. RADIUS and TACACS+ servers are often referred to as AAA servers.": "Authentication Authorization Accounting",
  "Kerberos uses mutual authentication to provide security for clients attempting to connect to Active Directory domain controllers. It uses inbound port __.": "88",
  "A ______ is a group of compromised computers that are controlled by a main computer (somewhere) that directs them to attack particular servers and routers on the Internet.": "botnet",
  "In a ________ attack, an attacker masquerades as another person by falsifying information.": "spoofing",
  "______ __ _______ is a broad term applied to many different types of network attacks that attempt to make computer resources unavailable. Generally, it is done to servers but can also be perpetrated against routers and other hosts. Examples of ______ __ _______ attacks include ping floods, Smurf attacks, SYN floods, Pings of Death, and fork bombs.": "Denial of Service",
  "An attacker (or group of attackers) may make use of a ___________ ______ __ _______ attack. In this type of attack, a group of compromised systems attacks a single target, causing denial of service at that host.": "Distributed Denial of Service",
  "A DDoS attack often utilizes a ______ — which is a large group of computers, known as robots or simply bots.": "botnet",
  "A _____________ attack uses a considerable set of precalculated encrypted passwords located in a lookup table.": "cryptanalysis",
  "___ attacks are a type of injection, in which malicious scripts are injected into otherwise benign and trusted websites. ___ attacks occur when an attacker uses a web application to send malicious code, generally in the form of a browser side script, to a different end user. Flaws that allow these attacks to succeed are quite widespread and occur anywhere a web application uses input from a user within the output it generates without validating or encoding it.": "XSS",
  "Within the context of cybersecurity, what does XSS stand for?": "Cross Site Scripting",
  "A ___ _________ attack consists of insertion or “injection” of a SQL query via the input data from the client to the application.": "SQL Injection",
  "As a reminder, _________ is the original name for folder. The more accurate names are _________ when working in any command line and folder when working in the GUI, but the two terms are sometimes used interchangeably.": "directory",
  "Another way to flush the DNS cache is to issue the command _____ ___ __ in PowerShell. But beware: This completely resets the TCP/IP connection for the network adapter.": "netsh int ip",
  "________ is the removal of data from a drive that is to be repurposed and used again within the organization. The diskpart utility can be used to clear the drive, but it is not appropriate for drive disposal.": "Clearing",
  "_______ a drive, or wiping its data, is recommended for sensitive data and drives that will leave the organization. It can be done in two ways: with the Secure Erase option (or a similar technique) or by degaussing the drive.": "Purging",
  "Enter the address bar command (Edge) to get to Settings.": "edge://settings",
  "Enter the address bar command (Chrome) to get to Settings.": "chrome://settings",
  "Enter the address bar command (Firefox) to get to Preferences.": "about:preferences",
  "___ occurs when two objects of different voltages come into contact with each other.": "ESD",
  "What does ESD stand for?": "electrostatic discharge"
}