{
  "Where should you go to find out what applications are running in the background in Windows 10?": ["Taskbar", "Start menu", "Quick Launch", "*Notification area", "Cortana"],
  "Which command can copy multiple files and entire directory trees?": ["copy", "cut", "paste", "*robocopy", "None of the listed"],
  "Which command determines whether protected system files have been overwritten and replaces those files with the original version?": ["chkdsk", "md", "*sfc", "xcopy", "None of the listed"],
  "You need to assign drive letters and make a partition active from the Command Prompt. What of the following will allow you to perform these activities?": ["Disk Management", "format", "defrag", "*diskpart", "None of the listed"],
  "You have been tasked with bringing the policies of a Windows 10 computer up to date. You won’t be able to log off and back on, and you must use the Command Prompt. Which of the following tools should you use?": ["shutdown", "rd", "*gpupdate", "Local Security Policy", "winver"],
  "Which command shows the path of routers between your computer and a web server?": ["ping","ipconfig","*tracert","nbstat","none of the listed"],
  "You need to map a network drive to a share named data1 on a computer named Jupiter-Server. You want to use the J: drive letter. Which syntax should you use to do this in the Command Prompt?": ["*net use J: \\\\Jupiter-Server\\data1","net use J \\Jupiter-Server\\data1","net use Jupiter-Server\\J\\data1","net use J: \\Jupiter-Server\\data1","none of the listed"],
  "A user’s computer is powered on and appears to work properly. However, the user cannot access any wired network resources, printers, or shared drives. In addition, the user cannot access the Internet. Which of the following commands should you use to troubleshoot the problem?": ["netstat","net use","*ping","nslookup","none of the listed"],
  "A customer is unable to access a network share. However, the customer can access email. You analyze the system and confirm that the customer has the correct permissions to access the share. Which command should you use first to troubleshoot the problem?": ["nslookup","*net use","ipconfig","ping","none of the listed"],
  "A technician is installing a new Windows application on a user’s workstation. Which of the following would be the best way for the technician to determine when the system was last rebooted?": ["System Information", "Device Manager", "Startup Repair", "System File Checker", "*Task Manager"],
  "A user received a message on their screen regarding malware, called the number displayed in the message, and paid a subscription fee to the person on the phone. Which of the following would best describe this message?": [" Incorrect site certificate", " New Windows updates", " Incorrect device drivers", " Invalid BIOS configuration", "*False antivirus alerts"],
  "A system administrator has just disconnected a system from the wired and wireless networks. Which of the following occurred just prior to these events?": ["System Restore was disabled", " End user was educated on security events", "*Malware symptoms were verified", "Windows update completed", " An anti-virus scan was performed"],
  "A mobile phone shows an OS update is available, but the phone will not update overnight. Which of the following would be the most likely reason for this issue?": ["NFC is disabled", "Phone is connected to power", "Storage drive is encrypted", "Guest account is disabled", "*Storage space is low"],
  "Which of the following do you type in the Run prompt to open the Device Manager?": ["mmc", "secpol.msc", "cmd", "*devmgmt.msc", "none of the listed"],
  "Which of the following would you use to track the percentage of resources being used?": ["devmgmt.msc", "eventvwr.msc", "compmgmt.msc", "*perfmon.msc", "none of the listed"],
  "Which log file in the Event Viewer contains information concerning auditing?": ["System", "Application", "Local Users and Groups", "*Security", "None of the listed"],
  "Which tool can run particular programs at times designated by the user?": ["Services", "*Task Scheduler", "Event Viewer", "Task Manager", "None of the listed"],
  "You are preparing to troubleshoot a system that is having some driver issues. Which of the following tools should you use to configure the system to boot safely?": ["Event Viewer", "Resource Monitor", "msinfo32", "*System Configuration", "None of the listed"],
  "You have been tasked with repairing a magnetic-based hard drive that is running sluggishly. Which of the following tools should you use to fix the problem? (Select the best answer.)": ["Disk Management", "*Optimize Drives", "Storage Spaces", "Mount point", "None of the listed"],
  "What is HKEY_LOCAL_MACHINE considered to be?": ["A registry entry", "A subkey", "A string value", "*A hive", "None of the listed"],
  "What must you do first to a basic disk to create spanned, striped, mirrored, or RAID 5 volumes in Disk Management?": ["Extend it", "Shrink it", "Split it", "Initialize it", "*Convert it to dynamic"]

}