{
  "Where should you go to find out what applications are running in the background in Windows 10?": ["Taskbar", "Start menu", "Quick Launch", "*Notification area", "Cortana"],
  "Which command can copy multiple files and entire directory trees?": ["copy", "cut", "paste", "*robocopy", "None of the listed"],
  "Which command determines whether protected system files have been overwritten and replaces those files with the original version?": ["chkdsk", "md", "*sfc", "xcopy", "None of the listed"],
  "You need to assign drive letters and make a partition active from the Command Prompt. What of the following will allow you to perform these activities?": ["Disk Management", "format", "defrag", "*diskpart", "None of the listed"],
  "You have been tasked with bringing the policies of a Windows 10 computer up to date. You won’t be able to log off and back on, and you must use the Command Prompt. Which of the following tools should you use?": ["shutdown", "rd", "*gpupdate", "Local Security Policy", "winver"],
  "Which command shows the path of routers between your computer and a web server?": ["ping","ipconfig","*tracert","nbstat","none of the listed"],
  "You need to map a network drive to a share named data1 on a computer named Jupiter-Server. You want to use the J: drive letter. Which syntax should you use to do this in the Command Prompt?": ["*net use J: \\\\Jupiter-Server\\data1","net use J \\Jupiter-Server\\data1","net use Jupiter-Server\\J\\data1","net use J: \\Jupiter-Server\\data1","none of the listed"],
  "A user’s computer is powered on and appears to work properly. However, the user cannot access any wired network resources, printers, or shared drives. In addition, the user cannot access the Internet. Which of the following commands should you use to troubleshoot the problem?": ["netstat","net use","*ping","nslookup","none of the listed"],
  "A customer is unable to access a network share. However, the customer can access email. You analyze the system and confirm that the customer has the correct permissions to access the share. Which command should you use first to troubleshoot the problem?": ["nslookup","*net use","ipconfig","ping","none of the listed"],
  "A technician is installing a new Windows application on a user’s workstation. Which of the following would be the best way for the technician to determine when the system was last rebooted?": ["System Information", "Device Manager", "Startup Repair", "System File Checker", "*Task Manager"],
  "A user received a message on their screen regarding malware, called the number displayed in the message, and paid a subscription fee to the person on the phone. Which of the following would best describe this message?": [" Incorrect site certificate", " New Windows updates", " Incorrect device drivers", " Invalid BIOS configuration", "*False antivirus alerts"],
  "A system administrator has just disconnected a system from the wired and wireless networks. Which of the following occurred just prior to these events?": ["System Restore was disabled", " End user was educated on security events", "*Malware symptoms were verified", "Windows update completed", " An anti-virus scan was performed"],
  "A mobile phone shows an OS update is available, but the phone will not update overnight. Which of the following would be the most likely reason for this issue?": ["NFC is disabled", "Phone is connected to power", "Storage drive is encrypted", "Guest account is disabled", "*Storage space is low"],
  "Which of the following do you type in the Run prompt to open the Device Manager?": ["mmc", "secpol.msc", "cmd", "*devmgmt.msc", "none of the listed"],
  "Which of the following would you use to track the percentage of resources being used?": ["devmgmt.msc", "eventvwr.msc", "compmgmt.msc", "*perfmon.msc", "none of the listed"],
  "Which log file in the Event Viewer contains information concerning auditing?": ["System", "Application", "Local Users and Groups", "*Security", "None of the listed"],
  "Which tool can run particular programs at times designated by the user?": ["Services", "*Task Scheduler", "Event Viewer", "Task Manager", "None of the listed"],
  "You are preparing to troubleshoot a system that is having some driver issues. Which of the following tools should you use to configure the system to boot safely?": ["Event Viewer", "Resource Monitor", "msinfo32", "*System Configuration", "None of the listed"],
  "You have been tasked with repairing a magnetic-based hard drive that is running sluggishly. Which of the following tools should you use to fix the problem? (Select the best answer.)": ["Disk Management", "*Optimize Drives", "Storage Spaces", "Mount point", "None of the listed"],
  "What is HKEY_LOCAL_MACHINE considered to be?": ["A registry entry", "A subkey", "A string value", "*A hive", "None of the listed"],
  "What must you do first to a basic disk to create spanned, striped, mirrored, or RAID 5 volumes in Disk Management?": ["Extend it", "Shrink it", "Split it", "Initialize it", "*Convert it to dynamic"],
  "Which power management mode stores data on a storage drive?": ["Sleep", "*Hibernate", "Standby", "All of the listed", "None of the listed"],
  "What tool can assist a user who needs to find results faster when searching for files on a storage drive?": ["firewall.cpl", "Internet Options", "appwiz.cpl", "*Indexing", "None of the listed"],
  "A customer wants you to set up the system to scale images at 200%. Which Control Panel icon should you access to configure this?": ["Programs and Features", "Mail", "Sound", "*Ease of Access Center", "Devices and Printers"],
  "Which of the following sections of Windows Settings allows a user to copy important information about a PC and possibly send it to a technician for troubleshooting purposes?": ["*System > About", "Network & Internet > Ethernet", "Ease of Access > Narrator", "Privacy > Diagnostics & Feedback", "None of the listed"],
  "Which window would you navigate to in order to modify the virtual memory settings in Windows? (Select the best answer.)": ["Network & Internet", "*Performance Options", "Devices", "Device Manager", "Display"],
  "What should you modify if you need to change the number of pixels that are displayed horizontally and vertically on the screen?": ["Color Space", "Refresh rate", "*Resolution", "Scaling", "None of the listed"],
  "You need to design a local area network for 10 computers with very limited data sharing. Which of the following network types is the best option?": ["*Workgroup", "Client/server", "VPN", "Domain", "None of the listed"],
  "You want to connect to a share on \\\\server1\\data-share. Which of the following should be used to accomplish this?": ["Use a proxy server", "Right-click the folder and select 'Share with'", "Use 'ipconfig'", "*Use 'net use'", "None of the listed"],
  "You have been tasked with setting up a client Windows computer. It needs to gain access to the Internet, but all web traffic is cached and filtered by a go-between server on the LAN. What should you configure to enable Internet access for the Windows client?": ["VPN", "*Proxy server", "Domain", "Workgroup", "None of the listed"],
  "In Windows 10, which network location profile setting should you choose if you are not sure what computers will be on the network or if you can trust them?": ["Private", "VPN", "Metered connection", "*Public", "None of the listed"],
  "What is the name of the folder where Windows stores 64-bit system files?": ["Systemroot", "*System32", "SysWOW64", "Program Files (x86)", "None of the listed"],
  "One of the users at your company attempts to install an application and receives the following error: Not enough disk space to install...Which of the following was overlooked by the user?": ["OS compatibility", "Installed method", "File permissions", "*System requirements", "None of the listed"],
  "Which of the following operating systems is a free download with no evaluation period limitations?": ["Windows", "*Ubuntu", "macOS", "iOS", "None of the listed"],
  "Which of the following is used on iPads newer than 2019?": ["Chrome OS", "Windows 10", "*iPad OS", "Android", "iOS"],
  "Scenario: It’s the summer of 2024. Your company has many types of technologies running—and many of them interact with each other. Of the following operating systems that are used in your company’s infrastructure, which is not a major security concern?": ["Windows 8.1", "Windows 10 (21H1)", "*Ubuntu 20.04 LTS", "macOS 11.0", "None of the listed"],
  "Which of the following statements is true?": ["Android is an example of closed source software.", "32-bit CPUs can only address a maximum of 256 GB of RAM.", "Chrome OS is designed by Apple to use mostly desktop applications.", "*64-bit versions of Windows can run 32-bit apps as well as 64-bit apps.", "All of the listed"],
  "Which of the following does macOS use that works in a similar fashion to Linux-based file systems?": ["*APFS", "EOL", "ext4", "exFAT", "None of the listed"],
  "Which of the following installation types would require PXE compliance?": ["Local", "*Network", "Internal", "USB flash drive", "None of the listed"],
  "To avoid SID conflicts when drive imaging, which program should you use in Windows?": ["*Sysprep", "diskpart", "SIM", "Windows Deployment Services", "None of the listed"],
  "You are tasked with installing Windows with the standard configuration. It needs to support a storage drive with a single 8 TB partition. Which of the following should you configure the system to use?": ["*GPT", "FAT32", "MBR", "ext4", "None of the listed"],
  "Which of the following uses an answer file to provide responses and eliminates the need for user intervention?": ["Factory recovery partition", "Clean installation", "*Unattended installation", "Reset your PC", "None of the listed"],
  "What should a technician consider first when planning to install Windows to a newer, less common storage drive? (Select the best answer.)": ["*Alternate third-party drivers", "A repair installation", "Recovery parition", "The product life cycle", "All of the listed"],
  "Which of the following is the built-in web browser for macOS?": ["*Safari", "Chrome", "Firefox", "Edge", "None of the listed"],
  "Which of the following should be enabled when you want a user at another Mac to take control of your computer?": ["Remote Desktop", "Remote Assistance", "*Screen Sharing", "Screen Mirroring", "None of the listed"],
  "Which utility allows a Mac user to dual-boot macOS and Windows?": ["Ubuntu", "apt-get", "bootrec", "*Boot Camp", "None of the listed"],
  "You want to save the state of a Mac running macOS. Which tool should be used?": ["System Restore", "*Time Machine", "Force Quit", "Disk Utility", "None of the listed"],
  "Due to recent corporate espionage attempts, a technician needs to secure the contents of the main storage drive on the CEO’s Mac. Which macOS utility will allow the tech to encrypt the drive? (Select the best answer.)": ["Terminal", "*FileVault", "App Store", "128-bit encryption", "None of the listed"],
  "Which program handles installing a printer’s driver automatically in macOS? (Select the best answer.)": ["Bonjour", "Magic Mouse", "*AirPrint", "iCloud", "None of the listed"],
  "You need to download an application that is not available on the App Store. It needs to be mounted as an image. Which of the following extensions should you use?": [".pkg", ".app", "*.dmg", "Finder", ".exe"],
  "A customer reports that a spinning wheel appears on her screen whenever she tries to run a specific application. What does this spinning wheel represent? (Select the best answer.)": ["A failing CPU", "*An Apple macOS proprietary crash screen", "A Microsoft Windows proprietary crash screen", "A Linux proprietary crash screen", "Extended loading"],
  "Which command in Linux shows the contents of a directory?": ["*ls", "pwd", "cd", "mv", "dir"],
  "Which command should be used to change the permissions of a file?": ["ps", "chown", "NTFS", "*chmod", "tree"],
  "You are working as a junior administrator at a midsized company. You are tasked with updating Linux system software. Which command should be used to gain the necessary permissions to update the software?": ["grep", "*sudo", "chmod", "pwd", "ls"],
  "One of your customers is trying to install a 3 TB storage drive to a Linux system. The customer wishes to use half of the drive capacity for one partition now and wants to have the option to increase the partition size later on. Which file system should you recommend?": ["NTFS", "FAT32", "*ext4", "APFS", "NFS"],
  "You are troubleshooting a network connectivity problem on a Linux computer. Which of the following commands will display information about the network interface?": ["*ip a", "grep -i", "sudo", "netsh", "dir"],
  "One of your customers tells you that an application in Linux will not open and gives this error: Only one instance of the program can be run at any time. You log in to the system as root and open Terminal. Which of the following commands should you run to ensure that no other instances of the program are open?": ["cp and rm", "ls and chown", "*ps and kill", "pwd and chmod", "sudo and nano"],
  "An administrator logs in to a Linux computer and runs the following command: ps -aux | grep firefox. Of the following, which best describes the functionality of this command?": ["*It locates and lists the processes used to run the Firefox web browser.", "It kills any running programs that start with the word firefox.", "It opens directories that start with the word firefox.", "It creates a new tab for filtering in Firefox.", "It returns nothing."],
  "Which of the following is the science of recognizing humans based on physical characteristics?": ["Mantraps", "*Biometrics", "Tailgating", "CAC", "None of the listed"],
  "You have been tasked with preventing unwanted removal of a webcam. Which of the following tools should you implement?": ["Smart card", "USB fingerprint scanner", "*USB lock", "Privacy filter", "None of the listed"],
  "When is a Windows computer completely secure?": ["When you have updated to the latest version", "When you have locked down the Local Security Policy", "When Microsoft releases the latest update", "*Never", "It already is"],
  "Which of the following is a built-in security component of Windows?": ["*UAC", "Firefox", "Active Directory", "MFA", "Safari"],
  "You have been tasked with configuring a user account so that its folders and settings will follow the user to whatever computer the user logs on to within the domain. Which of the following should you configure?": ["OU", "*Roaming profile", "Logon script", "Home folder mapped to a network drive", "Logout script"],
  "You need to block users from installing programs in Windows. Of the following, what tool should you use?": ["wf.msc", "Principle of least privilege", "Digital signature", "*gpedit.msc", "devmgmt.msc"],
  "You are moving up in the world and have been tasked with securing a server room. Your manager tells you to design a system that will implement two-factor authentication. Which of the following should you use as your solution to provide the best level of security for the server room?": ["A security guard and an entry control roster", "*A biometric lock and hardware tokens", "A door lock and an access control vestibule", "A server cabinet lock and badge readers", "None of the listed"],
  "Which of the following is the strongest form of wireless encryption?": ["WPA3", "WPA", "*AES", "TKIP", "WPA2"],
  "Which of the following types of malware is designed to gain administrative-level control of a system?": ["Ransomware", "Keylogger", "*Rootkit", "Spyware", "Trojan"],
  "One of your customers complains of a problem: When browsing the Internet, multiple browser pages start opening automatically. You notice that the computer is performing poorly, even when not connected to the Internet. What should you do?": ["Enable a pop-up blocker.", "Reboot the computer.", "*Install/scan with an anti-malware tool.", "Update the antivirus definitions.", "All of the listed."],
  "Which of the following is an attempt to guess a password by using a combination of letters and numbers?": ["*Brute-force", "Social engineering", "Dictionary", "Zero-day", "None of the listed"],
  "A user clicked a link in an email that appeared to be from his bank. The link led him to a page that requested he change his password to access his bank account. It turns out that the web page was fraudulent. This an example of which of the following?": ["Impersonation", "Dumpster diving", "*Phishing", "Shoulder surfing", "None of the listed"],
  "Several hundred infected computers simultaneously attacked your organization’s server, rendering it useless to legitimate users. This is an example of what kind of attack?": ["Botnet", "On-path attack", "Tailgating", "*DDoS attack", "Rainbow table"],
  "A hacker executed a coded attack against a vulnerability that has not yet been addressed by anyone. This is an example of what kind of attack?": ["DDoS attack", "Spoofing attack", "*Zero-day attack", "Brute-force attack", "Dictionary attack"],
  "You have been tasked with setting up encryption for a Windows computer. You are required to encrypt several shared folders within a partition so that they can’t be read by other users. What tool should you use?": ["BitLocker", "TPM", "Administrative share", "*EFS", "APFS"],
  "One of the users on your network is trying to access files shared on a remote computer. The file’s share permissions allow the user Full Control, but the NTFS permissions allow the user Read access. Which of the following will be the resulting access for the user?": ["Full Control", "Modify", "*Read", "Write", "Delete"],
  "You are tasked with encrypting several laptops using BitLocker. However, some of the laptops do not have a built-in TPM chip. What should you implement to enable BitLocker on those laptops?": ["Firwmare update", "MFA", "*USB key", "Encryption on the local drive", "None of the listed"],
  "Which Windows account would you create for someone who needs to regularly install software, change settings, and take ownership?": ["Power user", "Standard user", "Guest", "Root", "*Administrator"],
  "Which of the following is the strongest password?": ["|ocrian#", "Marqu1sD3S0d", "*This1sV#ryS3cure", "Thisisverysecure", "All of the listed"],
  "A customer complains that while he was away at lunch, someone used his computer to send emails to other co-workers without his knowledge. Which of the following should you recommend that the user do?": ["Enable a screensaver.", "Unplug the network cable before leaving for lunch.", "*Use the Windows lock feature.", "Enable the out-of-office message in email when leaving for lunch.", "All of the above."],
  "Which of the following best describes encryption?": ["*Prevents unauthorized users from viewing or reading data", "Prevents unauthorized users from deleting data", "Prevents unauthorized users from posing as the original source sending data", "Prevents unauthorized users from decompressing files", "None of the listed"],
  "How can you prevent applications from automatically executing, and possibly infecting a computer with malware, when removable media is inserted?": ["Enable the account lockout threshold policy.", "Turn on BitLocker.", "Turn off BitLocker To Go.", "*Disable AutoPlay.", "None of the listed."],
  "You want to prevent a user from accessing your phone while you step away from your desk. What should you do?": ["Implement remote backup.", "Set up a remote wipe program.", "*Configure a screen lock.", "Install a locator application.", "None of the listed."],
  "Which of the following can be described as removing limitations in iOS?": ["Rooting", "*Jailbreaking", "Geotracking", "Antivirus software", "None of the listed"],
  "Your organization is concerned about a potential scenario involving a mobile device containing confidential data being stolen. Which of the following should be recommended first? (Select the best answer.)": ["Remote backup application", "*Remote wipe program", "Passcode locks", "Locator application", "All of the listed"],
  "There are Android-based smartphones in your organization that are part of the BYOD infrastructure. They need to be able to connect to the LAN remotely using a VPN. Which of the following should you incorporate into the MDM profile for the smartphones to connect to the VPN securely? (Select the best answer.)": ["Antivirus software", "*Certificate", "Remote wipe", "Authenticator app", "Microsoft Intune"],
  "A drive needs to be disposed of in such a way that no one can access the data. Which method should be used?": ["format E:", "Clearing", "diskpart", "*Destruction", "Purging"],
  "A drive is to be repurposed within your company. You have been tasked with zeroing out the drive three times from within Windows. Which of the following methods will accomplish this?": ["Degaussing", "*format C: /fs:fat32 /p:3", "diskpart > select disk 1 > clean all", "dd if=/dev/zero of=/dev/sda1", "Clearing"],
  "You have been tasked with purging a drive so that it can be recycled to a sister company. Which of the following should you perform before sending the drive out?": ["Clear the drive.", "Degauss the drive.", "*Run Secure Erase on the drive.", "Pulverize the drive.", "None of the listed."],
  "You want to prevent certain users from accessing particular websites. What should you configure on the SOHO router?": ["MAC filtering", "Disable unused ports", "Port forwarding", "*Content filtering", "Power levels"],
  "You have been tasked with implementing ad blocking functionality within a web browser. Which of the following should you add to make ad blocking a reality?": ["*Extension", "Valid certificate", "Pop-up blocker", "Password manager", "None of the listed"],
  "A user’s computer is running very slow. You investigate and find out that there are many, many temporary files, caused by excessive browsing. Where would you go in Microsoft Edge to fix the problem?": ["edge://settings/profiles/sync", "chrome://extensions", "*edge://settings/privacy", "edge://settings/content", "none of the listed"],
  "Which option starts the operating system with a minimal set of drivers?": ["Windows RE", "System Restore", "*Safe Mode", "Debugging Mode", "None of the listed"],
  "Which tool should be used if you want to use Startup Repair in Windows?": ["File History", "*Windows RE", "System Restore", "Safe Mode", "None of the listed"],
  "Jack, an end user at your company, copied files from a USB thumb drive to his PC. When he was done, he updated his computer and restarted it. Then he received the error message “NO OS FOUND.” Which of the following should you try first to fix the problem?": ["Reboot the computer.", "Check the SATA cables.", "*Check the BIOS/UEFI boot order.", "Uninstall, reinstall, and update applications.", "Perform a hardware diagnostics check."],
  "One of your customers updated the software for a wireless adapter on a PC. After rebooting, the user logged in, and the computer displayed a blue screen. What should you do?": ["Install the device on a known good computer.", "Reboot the computer and access debugging mode.", "Purchase a new wireless adapter.", "*Roll back the device drivers in Safe Mode.", "None of the listed."],
  "A technician suspects protected Windows system files may be corrupt. What should the tech do first to verify these suspicions and fix any potential problems?": ["*Run a system file check.", "Roll back updates.", "Restart all services.", "Rebuild Windows profiles.", "None of the listed."],
  "A stop error could manifest as which of the following?": ["*BSOD", "An Event Viewer error", "An Action Center notification", "An Edge error", "None of the listed"],
  "Which tool can be used to restore a computer?": ["bootrec /fixboot", "*System Restore", "Windows Troubleshooter", "MSConfig", "None of the listed"],
  "Which of the following might cause a blue screen?": ["A faulty USB port", "A CPU without a fan", "*Bad drivers", "A program compatibility issue", "None of the listed"],
  "Which of the following is the best mode to use when scanning for viruses?": ["*Safe Mode", "Reset this PC", "Command Prompt only", "Boot into Windows normally", "None of the listed"],
  "You have been tasked with repairing a computer that is exhibiting the following symptoms: Excessive images Excessive pop-up windows appear. A particular website comes up every time the user searches.": ["Spam", "Virus", "Social engineering", "Trojan", "*Spyware"],
  "A co-worker technician is using certmgr.msc to analyze a problem with a computer. Which of the following issues is the technician most likely troubleshooting?": ["*Trusted root CA", "Hijacked email", "Spyware", "Browser redirection", "None of the listed"],
  "You are tasked with removing malware from a Windows computer. You already performed research on the malware and have determined that it is a memory virus. Which step should you take next?": ["Educate the user.", "*Quarantine the affected system.", "Remediate the affected system.", "Disable System Restore points.", "None of the listed."],
  "Several computers were infected with malware after end users clicked unknown links embedded in emails. You have successfully applied the first six steps of the best practice procedures for malware removal. What should you do next?": ["Schedule scans and run updates.", "Enable System Restore and create a restore point.", "Document findings, actions, and outcomes.", "*Educate the end users.", "None of the listed."],
  "An application won’t close on an Android smartphone. You’ve tried to force stop it—to no avail. What should you do?": ["Hard reset the device.", "Stop the underlying service in Running Services.", "*Soft reset the device.", "Take the device to an authorized service center.", "None of the listed."],
  "A technician has turned the Portrait Orientation Lock off for an iPhone user. Which common mobile OS problem does this rectify?": ["The Camera app fails to launch.", "*The screen does not autorotate.", "The OS fails to update.", "The battery fails to hold a charge.", "None of the listed."],
  "A user tells you that her iPad cannot send a large document to an iPhone that is in close proximity. The user can’t use the Internet because the network connection is too slow. You start investigating and find that Wi-Fi and Bluetooth are disabled. After you reenable them, the document is sent with no problems. Which of the following technologies was the user most likely trying to work with?": ["NFC", "*AirDrop", "Email", "Bluetooth", "None of the listed"],
  "A user downloaded an APK from an untrusted source and installed it. Now the mobile device is suffering from slow performance. The user also shows proof that the device is leaking data. What happened to the device?": ["Jailbreaking", "Application spoofing", "Developer mode", "*Rooting", "None of the listed"],
  "You are working at a help desk and encounter an issue that has not been identified or worked on previously. You go through your troubleshooting methodology, research, and, finally, solve the problem. Which of the following should you do so that the issue can be addressed properly if it is encountered again?": ["*Add your findings to the knowledge base.", "Enter the resolution into the ticket and close it.", "Escalate the issue to your immediate supervisor.", "Email the rest of the technicians on the team, explaining the problem.", "None of the listed."],
  "In a change management board meeting, you are discussing any vulnerabilities that can be mitigated as part of a recommended change and anything that could potentially occur due to that change. What best describes what you are discussing?": ["Purpose of change", "Scope of the change", "Backout plan", "Document changes", "*Risk analysis"],
  "You have been tasked with fixing a problem on a Windows server. You need to find out which switch it connects to and how it connects. Which of the following types of documentation should you consult?": ["Microsoft Knowledge Base", "*Network topology diagram", "Incident documentation", "Compliance policy", "Inventory management"],
  "You work with servers and network infrastructure in an IT department. You are proposing a major operating system upgrade to a Linux server. You have completed the documentation for this, and it shows that the upgrade will impact your organization’s web services. You finish the required risk analysis and document the processes that will be required. Which of the following should you complete next?": ["Rollback plan", "*Change request", "Purpose of the change", "Scope of the change", "None of the listed"],
  "Which type of backup scheme uses two types of media, with one being stored offsite?": ["GFS", "10-tape rotation", "*3-2-1", "Cloud storage", "None of the listed"],
  "You have implemented a backup solution that combines a full backup on Monday at 6 p.m. and incremental backups on Tuesday through Friday at 6 p.m.. If there was a storage drive failure on Saturday morning, how many backup tapes would be required to restore the entire backup?": ["1", "2", "4", "*5", "9"],
  "If a power supply fails, what should you do?": ["*Replace it.", "Repair it.", "Use a different computer.", "Switch it to a different voltage setting.", "None of the listed."],
  "You walk into the server room and see a person lying on the floor with a live electrical wire draped over. What should you do first?": ["Run out and call 911.", "Grab the wire and fling it off the person.", "Grab the person and drag him out from under the wire.", "*Grab a piece of wood and use it to move the wire off the person.", "Cry like a baby and assume fetal position."],
  "What document can aid you if a chemical spill occurs?": ["HEPA", "*MSDS", "OSHA", "EPA", "TLS"],
  "A co-worker complains that after the cleaning crew has come through, the keyboard irritates his hands and leaves some green residue. What should you do?": ["Call the fire department.", "*Contact the facilities department.", "Contact the manufacturer of the keyboard.", "Call OSHA and complain.", "Weep and assuem fetal position."],
  "You are concerned with power outages that occur infrequently and for short periods of time. You don’t want your users’ computers to suffer from potentially harmful restarts. What device should you install for the users’ computers?": ["Surge protector", "Line conditioner", "MSDS", "*UPS", "ESD Mat"],
  "What is the term for a total loss of power that lasts for a prolonged period?": ["*Power failure", "Surge", "Spike", "Under-volate event", "None of the listed"],
  "You want a cost-effective solution to the common surges that can affect your computer. Which device offers the best solution?": ["UPS", "*Surge suppressor", "Power strip", "Rack grounding", "None of the listed"],
  "How will speaking with a lot of jargon make the technician sound?": ["Competent", "*Insecure", "Smart", "Powerful", "Donkey"],
  "A customer experiences a server crash. When you arrive, the manager is upset about this problem. What do you need to remember in this scenario?": ["*Stay calm and do the job as efficiently as possible.", "Imagine the customer in his underwear.", "Avoid the customer and get the job done quickly.", "Refer the customer to your supervisor.", "None of the listed."],
  "You are a field technician working at a customer’s site. One of the workers asks you to load a copy of an organization’s purchased software on a personal laptop. What should you do first?": ["*Verify that the installation is allowed under the company’s licensing agreement.", "Act as though you are distracted and ignore the user.", "Leave the premises and inform the police.", "Tell the worker that installing unlicensed software is illegal.", "Notify the worker’s manager of a security breach."],
  "You have been asked by a customer at a hospital to perform routine maintenance on a laser printer. Before you begin, you notice that PHI has printed out. What should you do first?": ["Ensure the paper tray is full so that everything can print.", "Place the printed output in a secure recycle bin and begin maintenance.", "Kindly warn the customer that printing PHI at work is a HIPAA violation.", "*Ask the customer to move the printed output to another area.", "None of the listed."],
  "You want to list a variable number 16 times but don’t want to type 16 lines of code. Which of the following techniques should you use?": ["if-then", "*Looping", "Environment variables", "Comment syntax", "All of the listed"],
  "What should you type to comment out syntax in PowerShell?": ["$", "*#", "//", "()", "||"],
  "A technician just finished scripting a sequence of code and saved the script as a .sh file. What system is the technician working in?": ["PowerShell", "*Linux", "JavaScript", "Python", "Batch file"],
  "You are scripting in PowerShell and need to incorporate a construct that will repeat an operation until a specific requirement is met. What construct should you use, and which extension should you use to save the script?": ["if-then logic and .sh", "String variables and .py", "*Conditional loop and .ps1", "Integers and .vbs", "None of the listed"],
  "Which of the following can you use to map a network drive in PowerShell?": ["apt install", "for loop", "restart-computer", "Install-WUUpdates", "*New-PSDrive"],
  "Which program enables a user to invite a technician to help repair their computer remotely?": ["Remote Desktop Connection", "*Remote Assistance", "RDP", "Remote connectivity", "None of the listed"],
  "You have been tasked with making a command-line-based remote connection to an Ubuntu Linux computer located on your LAN so that you can run two scripts on it as an administrator. What protocol should you use? (Select the best answer.)": ["RDP", "mstsc", "*SSH", "VPN", "None of the listed"],
  "You are a technician working on a help desk. One of your customers installed a program to Windows that requires a license key. After the user contacted you, you accessed the customer’s system and entered the license key manually. Which tool did you use to accomplish this?": ["SSH", "FTP", "*RDP", "rsync", "None of the listed"],
  "Which of the following commands will display the MAC address of a computer?": ["ping", "netstat", "*ipconfig /all", "ipconfig /renew", "none of the listed"]
}