{
  "0": "Go to the notification area to find out what applications are running in the background. (Another way is to use the Task Manager.) In Windows 10, click the arrow that points up to show hidden icons. In other versions of Windows, the applications might actually appear in the notification area itself.",
  "1": "robocopy can copy an entire drive of information with just one command (including switches). xcopy could also do the job, but robocopy takes its place.",
  "2": "sfc determines whether system files have been overwritten and replaces those files with the original versions. chkdsk can check for errors and fix some errors, but it cannot work with system files. md is the command used to make a directory. xcopy is used to copy large amounts of data to a new location.",
  "3": "diskpart is the command-line counterpart of Disk Management. From the DISKPART> prompt, you can create, delete, and extend volumes; assign drive letters; make a partition active; and so on. The format command is used to format storage media to a particular file system, such as NTFS, FAT, or FAT32. defrag is the command-line version of the Disk Defragmenter; these tools help make the files on a drive contiguous instead of fragmented.",
  "4": "You should use gpupdate to bring the Windows policies up to date without requiring the admin to log off and on again. The shutdown command is used to turn off or restart a computer. rd is used to remove directories. The Local Security Policy is where you can go to modify many policy settings (such as the password policy), but it is a graphical tool. To enforce the changes made in the Local Security Policy, use the gpupdate command. winver is used to find out what operating system version you are running.",
  "5": "tracert is used to run a trace between the local system and a remote destination. It shows all routers along the way. ping is used to test connectivity to another system directly. ipconfig displays the Internet Protocol configuration of the local computer. nbtstat shows the name table cache and services running on the system.",
  "6": "You should use the command net use J: \\\\Jupiter-Server\\Data1. All the other answers are incorrect. The Universal Naming Convention (UNC) is \\\\computername\\sharename.",
  "7": "Of the listed answers, the best one is the ping command. It will help you to decipher what the problem is. However, consider using ipconfig /all before running ping. The netstat command shows a list of current connections (among other things). Chances are that there are none currently in the scenario. The net use command displays and makes connections to remote shares. The nslookup command does name resolution between domain names and IP addresses.",
  "8": "Implement the net use command so that you can make the connection to the network share. (Of course, you could also do this in File Explorer, but this chapter is about the command line!) Use nslookup to resolve domain names to IP addresses or to modify DNS servers. Use 'ipconfig' to analyze the system. Use ping to test whether another system is “alive” on the network.",
  "9": "The Windows Task Manager performance tab displays the up time of the operating system.",
  "10": "An anti-virus message identifying malware and then asking for money is commonly fake and is not a legitimate notification.",
  "11": "Once malware symptoms are verified on a system, the next step is to completely isolate the system from the network and other devices.",
  "12": "An operating system requires enough storage space to download and install the updated OS files.",
  "13": "devmgmt.msc is the Microsoft console window known as Device Manager. mmc opens up a new blank Microsoft Management Console. secpol.msc opens the Local Security Policy window. cmd opens the Command Prompt.",
  "14": "perfmon.msc (or perfmon.exe) opens the Performance Monitor utility, which is used to graphically track the resources that are being used on a computer, such as CPU, RAM, and so on. You could also use Task Manager > Performance to track resource usage (but without the ability to save the data), as well as the Resource Monitor. devmgmt.msc opens the Device Manager. eventvwr.msc opens the Event Viewer. compmgmt.msc opens the Computer Management console window.",
  "15": "The Security log contains information about auditing and other security events. The System log contains information about the OS and system files. The Application log contains information about built-in Windows programs and some third-party programs. Local Users and Groups is an administrative tool you can use to add people and systems to the local computer.",
  "16": "The Task Scheduler can run particular programs at scheduled times designated by the user. The Services console window is where you go to start, stop, and restart services. The Event Viewer is used to find messages about the system, applications, and security developments. The Task Manager is used to analyze the performance of a system and view the applications and services that are running.",
  "17": "Use the System Configuration utility (MSConfig) to configure the system to boot safely by going to the Boot tab and checking the Safe boot option. In the figure, it is configured as Minimal (the default), meaning that the system will boot with a minimal set of drivers and programs; however, there are several other options listed there. Make sure you go through the Windows utilities and all the tabs. Know what everything does!\n\nThe Event Viewer is a tool you can use to review Windows logs, including informational entries, warnings, and errors. The Resource Monitor is an analysis tool for hardware on your system; it’s more detailed than the Task Manager but less detailed (and easier to use) than Performance Monitor. The System Information tool (msinfo32) provides non-configurable information about hardware components and the software environment.",
  "18": "Use the Optimize Drives (Disk Defragmenter) utility. This utility attempts to defragment the drive and place the files in a contiguous order so that the hard disk drive (HDD) doesn’t behave so sluggishly. Of course, there could be other causes for the poor hard drive performance, such as too many applications at startup, malware, capacity issues, and so on. Disk Management is where you go to configure the storage drive but not to repair it—at least not directly. Storage Spaces is used to build software-based drive arrays. A mount point is a drive that is mapped to an empty folder; it is not a utility.",
  "19": "HKEY_LOCAL_MACHINE is one of the five visible hives that can be modified from within the Registry Editor. This hive stores hardware and software settings that are specific to the computer (for example TCP/IP settings).",
  "20": "Convert the disk to dynamic. Once this is done, the volume can be extended, shrunk, or split. You initialize a drive if it is not recognized by Windows immediately—for example, if it is a new or foreign drive that has been installed to a computer that already had Windows functioning.",
  "21": "When a computer hibernates, all the information in RAM is written to a file called hiberfil.sys in the root of C: within the storage drive.",
  "22": "Indexing helps you find results faster when you search your files for names or keywords. Indexing runs automatically on Windows 10 and constantly tracks any changes to indexed areas. firewall.cpl, when issued in the Run prompt or at the command line, opens Windows Defender Firewall. The Internet Options dialog box (inetcpl.cpl) is used to configure settings for the Internet Explorer web browser. appwiz.cpl opens the Programs and Features window, where you can uninstall or change programs and turn Windows features on and off.",
  "23": "Use the Ease of Access Center to turn on the magnifier and increase the view of the display to 200%. You can also operate the magnifier with keyboard shortcuts: Windows + Plus (+) to turn it on or to increase scaling; Windows + Minus (-) to reduce scaling; and Windows+Esc to turn off the program. Programs and Features is used to add and remove programs and add specific features to Windows. Mail and Sound are self-explanatory: they allow you to configure email and sound profiles, respectively. Devices and Printers is where you go to configure printers, keyboards, and multimedia devices.",
  "24": "Navigate to Windows Settings > System > About. Here you can copy device and Windows specifications and paste them into an email or to another location.",
  "25": "Navigate to the Performance Options dialog box and then click the Advanced tab to modify virtual memory in Windows. To access that window from the System Properties dialog box, click the Advanced tab, select the Performance section, and then click the Settings button.",
  "26": "Modify the screen resolution to change how many pixels are displayed on the screen (HxV). For example, change from 1280x720 to 1920x1080 or vice versa. Scaling is similar in that it makes text and images appear larger or smaller, depending on how you set it, but it doesn’t actually change the number of pixels that are displayed on the screen.",
  "27": "The best listed option is the workgroup. In Microsoft environments, it works well for 20 or fewer computers. Client/server networks such as Microsoft Active Directory domains are designed for more computers, often in an enterprise setting. A VPN is usually implemented for users who need secure connections to other networks or the Internet.",
  "28": "The net use command can connect to shares such as \\\\server1\\data-share or any other share on the network. Of course, you could also do this by mapping a network drive in File Explorer. A proxy server is used to filter and cache client connectivity to the Internet. Right-clicking the folder and selecting Share with allows you to share the folder but doesn’t make a connection to the share. ipconfig is used in the command line to learn the IP configuration of the network adapter.",
  "29": "Configure a proxy server by entering the IP address of the proxy server and the port to be used. A VPN allows secure connectivity to the Internet. A domain is a large network of computer systems that are centrally administered. A workgroup is a small group of networked systems.",
  "30": "A public profile means that network discovery and file/print sharing is turned off; this connection is good when you need to connect to public networks that you don’t trust because you don’t know what computers will be on those networks. Private is good for networks where you trust the systems. While a VPN is private and secure (hopefully), it is not one of the “network location profiles” in Windows but rather a network connection type. A metered connection should be used for hotspots, VPNs, and other connection types that may have data caps.",
  "31": "System32 is the folder used by Windows to store 64-bit system files. Systemroot is a variable used for the main Windows folder. More accurately, it is written as %systemroot%. It usually equals C:\\Windows. SysWOW64 is actually the location of 32-bit system files. Program Files (x86) is where 32-bit versions of programs are stored.",
  "32": "The user did not pay attention to the minimum system requirements. Perhaps the application needed 10 GB of storage drive space, and there was only 8 GB left on the partition. (Close is not good enough!) It appears that the installation started well enough, so the OS should be compatible, and the installation method is most likely correct. As long as the user has rights to run executable files, which is likely, there shouldn’t be any file permissions issues.",
  "33": "Ubuntu (regardless of the version) is a free download. While you can download some versions of Windows, they are only for evaluation periods of time. Apple-based operating systems, such as macOS and iOS, are not free downloads.",
  "34": "iPadOS is the operating system used on iPads that were built after 2019. iOS is used on iPhones. Chrome OS is used on a group of devices, most notably Chromebooks. Windows 10 is used on PCs, laptops, and Microsoft Surface devices. Android is used by several manufacturers of smartphones and tablets; it is the main competitor of iOS.",
  "35": "The only one of the listed answers that is not a major security concern is Ubuntu 20.04 LTS, which has an EOL of April 2025. The rest have EOL dates before the summer of 2024, and if they are not updated to something newer before that, they will cease to receive security updates—and that’s when it can get scary. But really now, this is a bit of a trick question. All of them are security concerns! Every OS and device on a network should be a security concern, regardless of age. Consider that.",
  "36": "The only true statement is that 64-bit versions of Windows can run 32-bit apps as well as 64-bit apps. 32-bit CPUs enable 4 GB of address space (RAM) maximum. On the other hand, 64-bit CPUs have a wider data path and can address a default maximum of 256 terabytes (TB) of RAM. For the A+ exam, remember that Android and Linux are examples of open source software, while Windows, macOS, and iOS are examples of closed source commercial software. Chrome OS is designed by Google to act as a workstation that uses mostly web-based applications.",
  "37": "Apple uses the Apple File System (APFS) on macOS and some other Apple-based devices. It works in a similar fashion to Linux-based file systems. End-of-life (EOL) is the discontinuation of updates and the ending of support for software/hardware. ext4 is the Fourth Extended file system in Linux. exFAT is the successor to FAT32 in Windows, it can handle large file sizes and can format media larger than 32 GB.",
  "38": "A network-based installation requires that the network card be PXE compliant so that it can boot to the network and locate a DHCP server and deployment server. Local installations, such as those using a USB flash drive or optical disc, do not need the network adapter. Internal installations, such as those that are done from a secondary internal drive, also do not need a PXE-compliant network card.",
  "39": "Sysprep can modify unattended installations so that every computer gets a unique SID (and other unique information). Windows SIM creates the answer files for unattended installations. diskpart is used to view and configure partitions from the Command Prompt in Windows. Windows Deployment Services (WDS) is run on Windows Server and is used to deploy operating systems across the network.",
  "40": "Use GPT as your partitioning scheme (instead of MBR) and follow that up by using NTFS as your file system for the partition. That is the typical setup when installing Windows. In this scenario, GPT and NTFS can support 16 TB partitions. FAT32 is an older file system that you could use, but it would not support the 8 TB partition that is required. ext4 is a Linux-based file system not used in Windows. Know your file systems for the exam!",
  "41": "An unattended installation uses an answer file that provides the responses needed for the installation. A factory recovery partition is preloaded by the computer manufacturer. A clean installation means that the OS is installed to a blank partition or new drive. Reset your PC is an option in Windows that allows a user to repair a computer by reinstalling the OS with one of two options: wiping all data or keeping user files.",
  "42": "If you are installing Windows to a newer and less common storage drive, you might have to supply the manufacturer’s drivers (or third-party drivers) if Windows doesn’t recognize the drive. A repair in-place upgrade and other similar repair-based installations are usually last-resort attempts to fix individual systems. The purpose of a recovery partition is to enable users to return their computers back to their state when they were first received. A product’s life cycle is everything that happens from purchase to installation to end-of-life (EOL) and recycling/disposal. Support is the important thing here when it comes to software. For example, once an OS is released, it is typically supported for three to five years (depending on the OS).",
  "43": "Safari is Apple’s web browser. It is used in macOS and iOS. Chrome is developed by Google and can be added to macOS. Firefox (Mozilla) can also be added to macOS. Microsoft Edge is the built-in browser that Windows uses.",
  "44": "Use Screen Sharing in macOS to allow another user to view and take control of your Mac. (The remote user could also use VNC.) Remote Desktop and Remote Assistance are similar programs used in Windows. Screen mirroring is a technology (common in mobile devices) that allows the display to be mirrored to a TV or to another computer.",
  "45": "Use the Boot Camp Assistant to dual-boot macOS and Windows on a Mac. Ubuntu is a distribution of Linux. apt-get is a command run in Linux to install, uninstall, and upgrade applications. bootrec is a command used in Windows to troubleshoot Boot Manager and data store issues.",
  "46": "Use the Time Machine to save the state of the computer or to restore to that computer’s earlier state. This is similar to the Windows System Restore utility. Force Quit is a utility in macOS that closes a nonresponsive application. Disk Utility is used to verify and repair macOS drives.",
  "47": "The tech can encrypt the contents of the main storage drive on a Mac with FileVault. Terminal allows you to enter commands, manipulate data, and make configuration changes and is similar to the PowerShell or Command Prompt in Windows. A typical way to get macOS apps (with a valid Apple ID) is to simply go to the App Store. Although FileVault implements AES 128-bit encryption to encrypt the entire contents of a drive, 128-bit encryption by itself is not a macOS utility.",
  "48": "AirPrint is the technology used to install a printer automatically in macOS (as long as the printer is compatible with macOS). Bonjour is a networking technology used by macOS to locate networked computers and devices. The Magic Mouse is an Apple mouse that allows for special clicking and gesturing, making it easier to navigate through macOS. iCloud is Apple’s cloud infrastructure, where a Mac user can store and back up data. While AirPrint might locate the printer driver on iCloud, iCloud is not the best answer.",
  "49": "Download the .dmg file format. This provides a mountable image that is opened by the Disk Image Mounter utility when double-clicked. It then mounts a virtual disk in Finder, but Finder is a program, not an extension. The .pkg and .app file types do not mount an image the way that a .dmg does. However, an .app might exist inside a .dmg!",
  "50": "A pinwheel, also known as a spinning pinwheel of death (SPOD), is an Apple macOS proprietary crash screen. An example of a Microsoft Windows proprietary crash screen is the blue screen of death (BSOD). Linux is an open source operating system. Although there are crash screens in Linux, they are not considered proprietary. A spinning wheel could possibly be caused by a failing CPU, but it is more likely caused by a stalled or frozen application.",
  "51": "ls will list the directory contents in Linux and macOS. It is similar to the dir command in Windows (which can also be used in Linux). pwd is used to display the full path of the working directory (for example, /home/root). cd is used to change directories. It is very similar to the Windows command of the same name. mv is used to move files.",
  "52": "Use the chmod command to change permissions in Linux and macOS. ps displays information about a given process. chown changes ownership of a file. NTFS is the file system used by Windows that allows for file-level security assigned by a user or group.",
  "53": "Use the sudo command before other commands that require administrative permissions. For example, you might type: sudo apt upgrade. This will initiate an upgrade on a Debian-based system. Without the sudo command, it will not work for any user other than root. Don’t forget, you can also use apt-get instead of apt. grep is used to search for matching information in specified files or to filter the results of a command being run. chmod is used to change permissions. pwd shows the current path that you are located in (pwd stands for print working directory).",
  "54": "Recommend ext4. It is the default on most Linux systems, and it has the ability to be resized at a later date. NTFS is a Windows file system, and it doesn’t function well with Linux, though it does allow for dynamic resizing of disks in Windows. FAT32 can be used in Linux, and it works well for drives that need to be accessed by Linux and Windows systems, but it doesn’t allow for resizing. APFS is the Apple File System, and it works only on macOS.",
  "55": "Use the ip a command (short for ip address) to find information about the network interface. grep is a search and filtering tool. If used with the -i option, it ignores case distinctions (meaning uppercase and lowercase). sudo needs to be issued before any administrative commands. netsh (short for network shell) is actually a Windows command that you would run in PowerShell or the Command Prompt—tricky!",
  "56": "Use the ps command to see what processes are running and the kill command to terminate the processes as necessary. cp is used to copy files, and rm is used to remove them. ls lists the contents of a directory, and chown changes ownership of files and directories. pwd shows the current path, and chmod changes permissions on files and directories. sudo is used before administrative commands, and nano opens the built-in text editor.",
  "57": "The command will list the processes used by the Firefox web browser. To show this, you would need to have Firefox running when you type the command. You can break it down like this: The ps command reports a snapshot of the current running processes. It can be used with a variety of options. In this case, you use -aux, which will see every single process. The pipe symbol ( | ) is used to make a modification to the ps command. The grep command filters the results of the ps command, asking the system to display only results that include the word firefox. ps -aux is commonly used but is a somewhat older option. A simpler way to display process IDs for a particular program would be to use the -e option. For more information, visit the manual page for ps. As for the incorrect answers: to “kill,” or terminate, programs or processes, you need the kill command. To open, or access, a directory, use the cd command. Creating new tabs in Firefox is best done in the browser itself!",
  "58": "Biometrics is the science of recognizing humans based on physical characteristics. In the authentication world, it falls into the category of “something a person is.” Access control vestibules (also known as mantraps) are implemented to stop tailgating. CAC, which stands for Common Access Card, is a card used by defense personnel such as DoD employees.",
  "59": "Use a USB lock to prevent the removal of USB-based devices such as external USB storage drives, keyboards, mice, and webcams. Smart cards and USB-based fingerprint scanners are ways to authenticate a user to the computer or network. A privacy filter is used to prevent shoulder surfing—in which a person attempts to watch what a user is typing/performing in a system—by reducing the viewing angle.",
  "60": "Neither Windows nor any other technology is ever completely secure. Complete security is impossible. But you can reduce risk to a certain extent by configuring a system properly and by using technology wisely—ultimately providing relative security. Updating to the latest version is often a good idea (if done according to organization policy), but you can’t rely on software updates alone. Using the Local Security Policy can help to “lock down” the system to a certain extent, but again, it is only one method. A combination of security updates, security configurations, and user education should be part of an overall security plan.",
  "61": "User Account Control (UAC) adds a layer of security to Windows to protect against malware and user error. Firefox is considered by many to be a secure web browser, but it is not included in Windows, nor can it be called a “security component”; it is a browser. Active Directory runs on Windows Server (though it can be accessed remotely from a Windows client); while it can increase the security of an organization’s Windows network, it isn’t a security component per se. With multi-factor authentication (MFA), two or more types of identification are required for a user to be authenticated to a system, network, or facility. MFA is not a built-in security component of Windows, but it can be accomplished on a Windows system—for example, by using the default username/password scheme (something the person knows), adding a USB-based fingerprint scanner (something the person is), and configuring them to both be used during logon to Windows.",
  "62": "Configure a roaming profile for the user. The roaming profile is configured at the domain controller and allows the user to move from one computer to the next, and the user profile follows—as long as the user is logging on with the same username and password and logging on to the domain. Refer to Figure 44.1 for the paths and naming conventions. OUs (organizational units) provide a way of organizing users, computers, and policies. A logon script is designed to execute programs, features, and actions when a user logs on. As long as a user logs on to the domain, this script will be initiated. The home folder is the default location where a user will save and download files; it can be either local or mapped to a network drive, the latter of which is preferred on a domain.",
  "63": "Use the Group Policy Editor (Run > gpedit.msc) to make modifications to how (and whether) programs are installed to Windows. (There are a variety of other ways as well.) Run > wf.msc brings up Windows Defender Firewall with Advanced Security. The principle of least privilege is not a tool but a concept, which states that a user (or program) should only be given the access required to complete a task—and no more. Digital signatures are used to cryptographically “sign” emails so that users can verify that the emails came from known good sources.",
  "64": "The most secure solution listed is the biometric lock and hardware tokens. This solution combines two factors of authentication: biometrics (something you are) and hardware tokens (something you have). While the other answers are good security methods, they do not incorporate two factors of authentication, and so they do not provide enough security for today’s typical organization. Remember the phrase defense in depth, which means layered security. The more layers you have (within reason), the more secure your environment will be.",
  "65": "Of the list of options, Advanced Encryption Standard (AES) is the strongest form of wireless encryption. WPA is a wireless encryption protocol, but it is deprecated; WPA2 or WPA3 is recommended. TKIP is deprecated and has been compromised; it should be avoided. Use TKIP, WEP, or the no authentication only option if you are temporarily connecting a device to a Wi-Fi network in an attempt to update it to a newer protocol or if you are initiating testing. Even then, use extreme caution!",
  "66": "A rootkit is designed to get administrative control of a computer system. The word root is synonymous with administrator in some systems (such as Linux and Unix). Ransomware is malware that encrypts a person’s files so that they are not accessible. Keyloggers capture the keystrokes a person makes on a keyboard. They are used to steal passwords and other confidential information. Spyware is malware that is used to watch (and possibly record) what a person is doing on a system and on the Internet.",
  "67": "Chances are that the customer’s computer does not have an antivirus or anti-malware program running. Install one (or enable one if it already exists). However, the problem is probably worse than that, and the system likely needs to be remediated (isolated, scanned, and so on). These are probably not just pop-ups; you normally see only one legitimate pop-up at a time. Plus, the computer is performing poorly, even when not connected to the Internet. Rebooting the computer can fix some issues, but it won’t fix a malware-infected system. Updating the antivirus software is always a good idea, but the problem might not be caused by a virus. It is more likely that the system has no anti-malware program running. Note: If you ever determine that a system is infected with malware, it should be disconnected from the network right away and placed in isolation until it is repaired properly!",
  "68": "A brute-force attack uses a combination of letters, numbers, and symbols to guess passwords, PINs, and passcodes. In contrast, a dictionary attack uses a list of words. Social engineering is an attempt to manipulate people into providing confidential information. A zero-day attack is an attack that has not yet been seen or documented, and it is very difficult to prepare for such attacks.",
  "69": "This is an example of phishing. Phishers use email to trick a person into divulging confidential information. While it could be said that the website that was accessed is impersonating the actual banking website, that would be more of a spoof; with true impersonation, a person mimics another person. Dumpster diving involves a person hunting through garbage or recycling to find confidential information. With shoulder surfing, a person attempts to get information by sight by, for example, looking over a person’s shoulder as that person types in a password.",
  "70": "In a distributed denial of service (DDoS) attack, many computers (zombies) work together in an attempt to bring down a server or router. While it makes use of a botnet, not all botnets are necessarily bad, nor is a botnet an attack. An on-path attack is a type of spoof in which a person uses a computer to intercept and either use or change data that is captured. Tailgating is a type of social engineering attack in which a person attempts to enter a secure area by following another person without that person’s knowledge. A rainbow table is set of precalculated encrypted passwords located in a lookup table.",
  "71": "A zero-day attack is an attack that exploits vulnerabilities that have not yet been discovered (besides by the attacker, that is). A DDoS attack is an attack that incorporates many systems in a collective attack against a server or network device. A spoofing attack involves technical impersonation; for example, a computer system sitting between a client and a server may impersonate the server in an attempt to retrieve user data. A brute-force attack is a password-based attack in which every conceivable password is attempted.",
  "72": "Use Encrypting File System (EFS). This is easily done: Right-click the folder(s), select Properties, click the Advanced button, and check Encrypt contents to secure data. At this point, other users will not be able to read the files contained in those folders. BitLocker is used to encrypt an entire storage drive (or volume), but in the scenario, you only need to encrypt several folders. A Trusted Platform Module (TPM) chip is a chip that is required for using BitLocker, but it is not necessary for EFS. By creating an administrator share, you will effectively hide the contents from typical users, unless they know the admin password. If they do know the password, then they can read the files. Regardless, administrative shares do not encrypt data.",
  "73": "The user will get only Read access. If you are using both sets of permissions, the most restrictive set will take precedence. In this case, NTFS permissions are more restrictive than share permissions.",
  "74": "If the laptops don’t have a TPM chip, use a USB key to provide the encryption required by BitLocker. A firmware update won’t help in this scenario; the TPM chip is an actual piece of hardware that is integrated to the motherboard. MFA stands for multi-factor authentication. While MFA is a good idea, this question deals with encryption, not authentication. Encrypting the local drive is the task at hand, but you need to get BitLocker to work first!",
  "75": "Administrators have full control of an operating system. Power users are included in Windows for backward compatibility with older versions, and are seldom used. Standard users are the normal default accounts for people who can log on to the network. Guests have limited access to the system. A guest cannot install software or hardware, cannot change settings, cannot access any data, and cannot change the password."
}