{
  "Where should you go to find out what applications are running in the background in Windows 10?": ["Taskbar", "Start menu", "Quick Launch", "*Notification area", "Cortana"],
  "Which command can copy multiple files and entire directory trees?": ["copy", "cut", "paste", "*robocopy", "None of the listed"],
  "Which command determines whether protected system files have been overwritten and replaces those files with the original version?": ["chkdsk", "md", "*sfc", "xcopy", "None of the listed"],
  "You need to assign drive letters and make a partition active from the Command Prompt. What of the following will allow you to perform these activities?": ["Disk Management", "format", "defrag", "*diskpart", "None of the listed"],
  "You have been tasked with bringing the policies of a Windows 10 computer up to date. You won’t be able to log off and back on, and you must use the Command Prompt. Which of the following tools should you use?": ["shutdown", "rd", "*gpupdate", "Local Security Policy", "winver"],
  "Which command shows the path of routers between your computer and a web server?": ["ping","ipconfig","*tracert","nbstat","none of the listed"],
  "You need to map a network drive to a share named data1 on a computer named Jupiter-Server. You want to use the J: drive letter. Which syntax should you use to do this in the Command Prompt?": ["*net use J: \\\\Jupiter-Server\\data1","net use J \\Jupiter-Server\\data1","net use Jupiter-Server\\J\\data1","net use J: \\Jupiter-Server\\data1","none of the listed"],
  "A user’s computer is powered on and appears to work properly. However, the user cannot access any wired network resources, printers, or shared drives. In addition, the user cannot access the Internet. Which of the following commands should you use to troubleshoot the problem?": ["netstat","net use","*ping","nslookup","none of the listed"],
  "A customer is unable to access a network share. However, the customer can access email. You analyze the system and confirm that the customer has the correct permissions to access the share. Which command should you use first to troubleshoot the problem?": ["nslookup","*net use","ipconfig","ping","none of the listed"],
  "A technician is installing a new Windows application on a user’s workstation. Which of the following would be the best way for the technician to determine when the system was last rebooted?": ["System Information", "Device Manager", "Startup Repair", "System File Checker", "*Task Manager"],
  "A user received a message on their screen regarding malware, called the number displayed in the message, and paid a subscription fee to the person on the phone. Which of the following would best describe this message?": [" Incorrect site certificate", " New Windows updates", " Incorrect device drivers", " Invalid BIOS configuration", "*False antivirus alerts"],
  "A system administrator has just disconnected a system from the wired and wireless networks. Which of the following occurred just prior to these events?": ["System Restore was disabled", " End user was educated on security events", "*Malware symptoms were verified", "Windows update completed", " An anti-virus scan was performed"],
  "A mobile phone shows an OS update is available, but the phone will not update overnight. Which of the following would be the most likely reason for this issue?": ["NFC is disabled", "Phone is connected to power", "Storage drive is encrypted", "Guest account is disabled", "*Storage space is low"],
  "Which of the following do you type in the Run prompt to open the Device Manager?": ["mmc", "secpol.msc", "cmd", "*devmgmt.msc", "none of the listed"],
  "Which of the following would you use to track the percentage of resources being used?": ["devmgmt.msc", "eventvwr.msc", "compmgmt.msc", "*perfmon.msc", "none of the listed"],
  "Which log file in the Event Viewer contains information concerning auditing?": ["System", "Application", "Local Users and Groups", "*Security", "None of the listed"],
  "Which tool can run particular programs at times designated by the user?": ["Services", "*Task Scheduler", "Event Viewer", "Task Manager", "None of the listed"],
  "You are preparing to troubleshoot a system that is having some driver issues. Which of the following tools should you use to configure the system to boot safely?": ["Event Viewer", "Resource Monitor", "msinfo32", "*System Configuration", "None of the listed"],
  "You have been tasked with repairing a magnetic-based hard drive that is running sluggishly. Which of the following tools should you use to fix the problem? (Select the best answer.)": ["Disk Management", "*Optimize Drives", "Storage Spaces", "Mount point", "None of the listed"],
  "What is HKEY_LOCAL_MACHINE considered to be?": ["A registry entry", "A subkey", "A string value", "*A hive", "None of the listed"],
  "What must you do first to a basic disk to create spanned, striped, mirrored, or RAID 5 volumes in Disk Management?": ["Extend it", "Shrink it", "Split it", "Initialize it", "*Convert it to dynamic"],
  "Which power management mode stores data on a storage drive?": ["Sleep", "*Hibernate", "Standby", "All of the listed", "None of the listed"],
  "What tool can assist a user who needs to find results faster when searching for files on a storage drive?": ["firewall.cpl", "Internet Options", "appwiz.cpl", "*Indexing", "None of the listed"],
  "A customer wants you to set up the system to scale images at 200%. Which Control Panel icon should you access to configure this?": ["Programs and Features", "Mail", "Sound", "*Ease of Access Center", "Devices and Printers"],
  "Which of the following sections of Windows Settings allows a user to copy important information about a PC and possibly send it to a technician for troubleshooting purposes?": ["*System > About", "Network & Internet > Ethernet", "Ease of Access > Narrator", "Privacy > Diagnostics & Feedback", "None of the listed"],
  "Which window would you navigate to in order to modify the virtual memory settings in Windows? (Select the best answer.)": ["Network & Internet", "*Performance Options", "Devices", "Device Manager", "Display"],
  "What should you modify if you need to change the number of pixels that are displayed horizontally and vertically on the screen?": ["Color Space", "Refresh rate", "*Resolution", "Scaling", "None of the listed"],
  "You need to design a local area network for 10 computers with very limited data sharing. Which of the following network types is the best option?": ["*Workgroup", "Client/server", "VPN", "Domain", "None of the listed"],
  "You want to connect to a share on \\\\server1\\data-share. Which of the following should be used to accomplish this?": ["Use a proxy server", "Right-click the folder and select 'Share with'", "Use 'ipconfig'", "*Use 'net use'", "None of the listed"],
  "You have been tasked with setting up a client Windows computer. It needs to gain access to the Internet, but all web traffic is cached and filtered by a go-between server on the LAN. What should you configure to enable Internet access for the Windows client?": ["VPN", "*Proxy server", "Domain", "Workgroup", "None of the listed"],
  "In Windows 10, which network location profile setting should you choose if you are not sure what computers will be on the network or if you can trust them?": ["Private", "VPN", "Metered connection", "*Public", "None of the listed"],
  "What is the name of the folder where Windows stores 64-bit system files?": ["Systemroot", "*System32", "SysWOW64", "Program Files (x86)", "None of the listed"],
  "One of the users at your company attempts to install an application and receives the following error: Not enough disk space to install...Which of the following was overlooked by the user?": ["OS compatibility", "Installed method", "File permissions", "*System requirements", "None of the listed"],
  "Which of the following operating sysetms is a free download with no evaluation period limitations?": ["Windows", "*Ubuntu", "macOS", "iOS", "None of the listed"],
  "Which of the following is used on iPads newer than 2019?": ["Chrome OS", "Windows 10", "*iPad OS", "Android", "iOS"],
  "Scenario: It’s the summer of 2024. Your company has many types of technologies running—and many of them interact with each other. Of the following operating systems that are used in your company’s infrastructure, which is not a major security concern?": ["Windows 8.1", "Windows 10 (21H1)", "*Ubuntu 20.04 LTS", "macOS 11.0", "None of the listed"],
  "Which of the following statements is true?": ["Android is an example of closed source software.", "32-bit CPUs can only address a maximum of 256 GB of RAM.", "Chrome OS is designed by Apple to use mostly desktop applications.", "*64-bit versions of Windows can run 32-bit apps as well as 64-bit apps.", "All of the listed"],
  "Which of the following does macOS use that works in a similar fashion to Linux-based file systems?": ["*APFS", "EOL", "ext4", "exFAT", "None of the listed"],
  "Which of the following installation types would require PXE compliance?": ["Local", "*Network", "Internal", "USB flash drive", "None of the listed"],
  "To avoid SID conflicts when drive imaging, which program should you use in Windows?": ["*Sysprep", "diskpart", "SIM", "Windows Deployment Services", "None of the listed"],
  "You are tasked with installing Windows with the standard configuration. It needs to support a storage drive with a single 8 TB partition. Which of the following should you configure the system to use?": ["*GPT", "FAT32", "MBR", "ext4", "None of the listed"],
  "Which of the following uses an answer file to provide responses and eliminates the need for user intervention?": ["Factory recovery partition", "Clean installation", "*Unattended installation", "Reset your PC", "None of the listed"],
  "What should a technician consider first when planning to install Windows to a newer, less common storage drive? (Select the best answer.)": ["*Alternate third-party drivers", "A repair installation", "Recovery parition", "The product life cycle", "All of the listed"],
  "Which of the following is the built-in web browser for macOS?": ["*Safari", "Chrome", "Firefox", "Edge", "None of the listed"],
  "Which of the following should be enabled when you want a user at another Mac to take control of your computer?": ["Remote Desktop", "Remote Assistance", "*Screen Sharing", "Screen Mirroring", "None of the listed"],
  "Which utility allows a Mac user to dual-boot macOS and Windows?": ["Ubuntu", "apt-get", "bootrec", "*Boot Camp", "None of the listed"],
  "You want to save the state of a Mac running macOS. Which tool should be used?": ["System Restore", "*Time Machine", "Force Quit", "Disk Utility", "None of the listed"],
  "Due to recent corporate espionage attempts, a technician needs to secure the contents of the main storage drive on the CEO’s Mac. Which macOS utility will allow the tech to encrypt the drive? (Select the best answer.)": ["Terminal", "*FileVault", "App Store", "128-bit encryption", "None of the listed"],
  "Which program handles installing a printer’s driver automatically in macOS? (Select the best answer.)": ["Bonjour", "Magic Mouse", "*AirPrint", "iCloud", "None of the listed"],
  "You need to download an application that is not available on the App Store. It needs to be mounted as an image. Which of the following extensions should you use?": [".pkg", ".app", "*.dmg", "Finder", ".exe"],
  "A customer reports that a spinning wheel appears on her screen whenever she tries to run a specific application. What does this spinning wheel represent? (Select the best answer.)": ["A failing CPU", "*An Apple macOS proprietary crash screen", "A Microsoft Windows proprietary crash screen", "A Linux proprietary crash screen", "Extended loading"],
  "Which command in Linux shows the contents of a directory?": ["*ls", "pwd", "cd", "mv", "dir"],
  "Which command should be used to change the permissions of a file?": ["ps", "chown", "NTFS", "*chmod", "tree"],
  "You are working as a junior administrator at a midsized company. You are tasked with updating Linux system software. Which command should be used to gain the necessary permissions to update the software?": ["grep", "*sudo", "chmod", "pwd", "ls"],
  "One of your customers is trying to install a 3 TB storage drive to a Linux system. The customer wishes to use half of the drive capacity for one partition now and wants to have the option to increase the partition size later on. Which file system should you recommend?": ["NTFS", "FAT32", "*ext4", "APFS", "NFS"],
  "You are troubleshooting a network connectivity problem on a Linux computer. Which of the following commands will display information about the network interface?": ["*ip a", "grep -i", "sudo", "netsh", "dir"],
  "One of your customers tells you that an application in Linux will not open and gives this error: Only one instance of the program can be run at any time. You log in to the system as root and open Terminal. Which of the following commands should you run to ensure that no other instances of the program are open?": ["cp and rm", "ls and chown", "*ps and kill", "pwd and chmod", "sudo and nano"],
  "An administrator logs in to a Linux computer and runs the following command: ps -aux | grep firefox. Of the following, which best describes the functionality of this command?": ["*It locates and lists the processes used to run the Firefox web browser.", "It kills any running programs that start with the word firefox.", "It opens directories that start with the word firefox.", "It creates a new tab for filtering in Firefox.", "It returns nothing."],
  "Which of the following is the science of recognizing humans based on physical characteristics?": ["Mantraps", "*Biometrics", "Tailgating", "CAC", "None of the listed"],
  "You have been tasked with preventing unwanted removal of a webcam. Which of the following tools should you implement?": ["Smart card", "USB fingerprint scanner", "*USB lock", "Privacy filter", "None of the listed"],
  "When is a Windows computer completely secure?": ["When you have updated to the latest version", "When you have locked down the Local Security Policy", "When Microsoft releases the latest update", "*Never", "It already is"],
  "Which of the following is a built-in security component of Windows?": ["*UAC", "Firefox", "Active Directory", "MFA", "Safari"],
  "You have been tasked with configuring a user account so that its folders and settings will follow the user to whatever computer the user logs on to within the domain. Which of the following should you configure?": ["OU", "*Roaming profile", "Logon script", "Home folder mapped to a network drive", "Logout script"],
  "You need to block users from installing programs in Windows. Of the following, what tool should you use?": ["wf.msc", "Principle of least privilege", "Digital signature", "*gpedit.msc", "devmgmt.msc"],
  "You are moving up in the world and have been tasked with securing a server room. Your manager tells you to design a system that will implement two-factor authentication. Which of the following should you use as your solution to provide the best level of security for the server room?": ["A security guard and an entry control roster", "*A biometric lock and hardware tokens", "A door lock and an access control vestibule", "A server cabinet lock and badge readers", "None of the listed"],
  "Which of the following is the strongest form of wireless encryption?": ["WPA3", "WPA", "*AES", "TKIP", "WPA2"],
  "Which of the following types of malware is designed to gain administrative-level control of a system?": ["Ransomware", "Keylogger", "*Rootkit", "Spyware", "Trojan"],
  "One of your customers complains of a problem: When browsing the Internet, multiple browser pages start opening automatically. You notice that the computer is performing poorly, even when not connected to the Internet. What should you do?": ["Enable a pop-up blocker.", "Reboot the computer.", "*Install/scan with an anti-malware tool.", "Update the antivirus definitions.", "All of the listed."],
  "Which of the following is an attempt to guess a password by using a combination of letters and numbers?": ["*Brute-force", "Social engineering", "Dictionary", "Zero-day", "None of the listed"],
  "A user clicked a link in an email that appeared to be from his bank. The link led him to a page that requested he change his password to access his bank account. It turns out that the web page was fraudulent. This an example of which of the following?": ["Impersonation", "Dumpster diving", "*Phishing", "Shoulder surfing", "None of the listed"],
  "Several hundred infected computers simultaneously attacked your organization’s server, rendering it useless to legitimate users. This is an example of what kind of attack?": ["Botnet", "On-path attack", "Tailgating", "*DDoS attack", "Rainbow table"],
  "A hacker executed a coded attack against a vulnerability that has not yet been addressed by anyone. This is an example of what kind of attack?": ["DDoS attack", "Spoofing attack", "*Zero-day attack", "Brute-force attack", "Dictionary attack"],
  "You have been tasked with setting up encryption for a Windows computer. You are required to encrypt several shared folders within a partition so that they can’t be read by other users. What tool should you use?": ["BitLocker", "TPM", "Administrative share", "*EFS", "APFS"],
  "One of the users on your network is trying to access files shared on a remote computer. The file’s share permissions allow the user Full Control, but the NTFS permissions allow the user Read access. Which of the following will be the resulting access for the user?": ["Full Control", "Modify", "*Read", "Write", "Delete"],
  "You are tasked with encrypting several laptops using BitLocker. However, some of the laptops do not have a built-in TPM chip. What should you implement to enable BitLocker on those laptops?": ["Firwmare update", "MFA", "*USB key", "Encryption on the local drive", "None of the listed"],
  "Which Windows account would you create for someone who needs to regularly install software, change settings, and take ownership?": ["Power user", "Standard user", "Guest", "Root", "*Administrator"]
}