{
  "0": "Go to the notification area to find out what applications are running in the background. (Another way is to use the Task Manager.) In Windows 10, click the arrow that points up to show hidden icons. In other versions of Windows, the applications might actually appear in the notification area itself.",
  "1": "robocopy can copy an entire drive of information with just one command (including switches). xcopy could also do the job, but robocopy takes its place.",
  "2": "sfc determines whether system files have been overwritten and replaces those files with the original versions. chkdsk can check for errors and fix some errors, but it cannot work with system files. md is the command used to make a directory. xcopy is used to copy large amounts of data to a new location.",
  "3": "diskpart is the command-line counterpart of Disk Management. From the DISKPART> prompt, you can create, delete, and extend volumes; assign drive letters; make a partition active; and so on. The format command is used to format storage media to a particular file system, such as NTFS, FAT, or FAT32. defrag is the command-line version of the Disk Defragmenter; these tools help make the files on a drive contiguous instead of fragmented.",
  "4": "You should use gpupdate to bring the Windows policies up to date without requiring the admin to log off and on again. The shutdown command is used to turn off or restart a computer. rd is used to remove directories. The Local Security Policy is where you can go to modify many policy settings (such as the password policy), but it is a graphical tool. To enforce the changes made in the Local Security Policy, use the gpupdate command. winver is used to find out what operating system version you are running.",
  "5": "tracert is used to run a trace between the local system and a remote destination. It shows all routers along the way. ping is used to test connectivity to another system directly. ipconfig displays the Internet Protocol configuration of the local computer. nbtstat shows the name table cache and services running on the system.",
  "6": "You should use the command net use J: \\\\Jupiter-Server\\Data1. All the other answers are incorrect. The Universal Naming Convention (UNC) is \\\\computername\\sharename.",
  "7": "Of the listed answers, the best one is the ping command. It will help you to decipher what the problem is. However, consider using ipconfig /all before running ping. The netstat command shows a list of current connections (among other things). Chances are that there are none currently in the scenario. The net use command displays and makes connections to remote shares. The nslookup command does name resolution between domain names and IP addresses.",
  "8": "Implement the net use command so that you can make the connection to the network share. (Of course, you could also do this in File Explorer, but this chapter is about the command line!) Use nslookup to resolve domain names to IP addresses or to modify DNS servers. Use ipconfig to analyze the system. Use ping to test whether another system is “alive” on the network.",
  "9": "The Windows Task Manager performance tab displays the up time of the operating system.",
  "10": "An anti-virus message identifying malware and then asking for money is commonly fake and is not a legitimate notification.",
  "11": "Once malware symptoms are verified on a system, the next step is to completely isolate the system from the network and other devices.",
  "12": "An operating system requires enough storage space to download and install the updated OS files.",
  "13": "devmgmt.msc is the Microsoft console window known as Device Manager. mmc opens up a new blank Microsoft Management Console. secpol.msc opens the Local Security Policy window. cmd opens the Command Prompt.",
  "14": "perfmon.msc (or perfmon.exe) opens the Performance Monitor utility, which is used to graphically track the resources that are being used on a computer, such as CPU, RAM, and so on. You could also use Task Manager > Performance to track resource usage (but without the ability to save the data), as well as the Resource Monitor. devmgmt.msc opens the Device Manager. eventvwr.msc opens the Event Viewer. compmgmt.msc opens the Computer Management console window.",
  "15": "The Security log contains information about auditing and other security events. The System log contains information about the OS and system files. The Application log contains information about built-in Windows programs and some third-party programs. Local Users and Groups is an administrative tool you can use to add people and systems to the local computer.",
  "16": "The Task Scheduler can run particular programs at scheduled times designated by the user. The Services console window is where you go to start, stop, and restart services. The Event Viewer is used to find messages about the system, applications, and security developments. The Task Manager is used to analyze the performance of a system and view the applications and services that are running.",
  "17": "Use the System Configuration utility (MSConfig) to configure the system to boot safely by going to the Boot tab and checking the Safe boot option, as shown in Figure 34.4. In the figure, it is configured as Minimal (the default), meaning that the system will boot with a minimal set of drivers and programs; however, there are several other options listed there. Make sure you go through the Windows utilities and all the tabs. Know what everything does!\n\nThe Event Viewer is a tool you can use to review Windows logs, including informational entries, warnings, and errors. The Resource Monitor is an analysis tool for hardware on your system; it’s more detailed than the Task Manager but less detailed (and easier to use) than Performance Monitor. The System Information tool (msinfo32) provides non-configurable information about hardware components and the software environment.",
  "18": "Use the Optimize Drives (Disk Defragmenter) utility. This utility attempts to defragment the drive and place the files in a contiguous order so that the hard disk drive (HDD) doesn’t behave so sluggishly. Of course, there could be other causes for the poor hard drive performance, such as too many applications at startup, malware, capacity issues, and so on. Disk Management is where you go to configure the storage drive but not to repair it—at least not directly. Storage Spaces is used to build software-based drive arrays. A mount point is a drive that is mapped to an empty folder; it is not a utility.",
  "19": "HKEY_LOCAL_MACHINE is one of the five visible hives that can be modified from within the Registry Editor. This hive stores hardware and software settings that are specific to the computer (for example TCP/IP settings).",
  "20": "Convert the disk to dynamic. Once this is done, the volume can be extended, shrunk, or split. You initialize a drive if it is not recognized by Windows immediately—for example, if it is a new or foreign drive that has been installed to a computer that already had Windows functioning.",
  "21": "When a computer hibernates, all the information in RAM is written to a file called hiberfil.sys in the root of C: within the storage drive.",
  "22": "Indexing helps you find results faster when you search your files for names or keywords. Indexing runs automatically on Windows 10 and constantly tracks any changes to indexed areas. firewall.cpl, when issued in the Run prompt or at the command line, opens Windows Defender Firewall. The Internet Options dialog box (inetcpl.cpl) is used to configure settings for the Internet Explorer web browser. appwiz.cpl opens the Programs and Features window, where you can uninstall or change programs and turn Windows features on and off.",
  "23": "Use the Ease of Access Center to turn on the magnifier and increase the view of the display to 200%. You can also operate the magnifier with keyboard shortcuts: Windows + Plus (+) to turn it on or to increase scaling; Windows + Minus (-) to reduce scaling; and Windows+Esc to turn off the program. Programs and Features is used to add and remove programs and add specific features to Windows. Mail and Sound are self-explanatory: they allow you to configure email and sound profiles, respectively. Devices and Printers is where you go to configure printers, keyboards, and multimedia devices.",
  "24": "Navigate to Windows Settings > System > About. Here you can copy device and Windows specifications and paste them into an email or to another location.",
  "25": "Navigate to the Performance Options dialog box and then click the Advanced tab to modify virtual memory in Windows. To access that window from the System Properties dialog box, click the Advanced tab, select the Performance section, and then click the Settings button.",
  "26": "Modify the screen resolution to change how many pixels are displayed on the screen (HxV). For example, change from 1280x720 to 1920x1080 or vice versa. Scaling is similar in that it makes text and images appear larger or smaller, depending on how you set it, but it doesn’t actually change the number of pixels that are displayed on the screen."
}