{
    "0": "The OSI model can be used as a bottom-to-top troubleshooting tool. For example, troubleshooting a network interface card (NIC) or network wiring would begin at Layer 1, the physical layer where electrical functions support physical connections. If the problem is not found there, then the next step would be to run a loopback test on the NIC (moving up to Layer 2), and so on.",
    "1": "On the Network+ exam, you might see an OSI layer referenced either by its name, such as network layer, or by its layer number. For instance, you might find that a router is referred to as a Layer 3 device. An easy mnemonic that you can use to remember the layers from top to bottom is: All People Seem To Need Data Processing.",
    "2": "Be sure you understand the OSI model and its purpose. You will almost certainly be asked questions on it during the exam. Know Table 1.1 well!",
    "3": "For the Network+ exam, you are expected to identify at which layer of the OSI model certain network devices operate.",
    "4": "Adding protocol information to data as it passes through layers is known as encapsulation. Removing protocol information to data as it passes through layers is known as decapsulation.",
    "5": "Connection-oriented protocols such as TCP can accommodate lost or dropped packets by asking the sending device to retransmit them. They can do this because they wait for all the packets in a message to be received before considering the transmission complete. On the sending end, connection-oriented protocols also assume that a lack of acknowledgment is sufficient reason to retransmit.",
    "6": "As you work through the various protocols, keep an eye out for those that are connectionless and those that are connection oriented. Also, look for protocols such as TCP that guarantee delivery of data and those such as UDP that are a fire-and-forget or best-delivery method.",
    "7": "IP operates at the network layer of the OSI model.",
    "8": "TCP operates at the transport layer of the OSI model.",
    "9": "Remember that TCP is a connection-oriented protocol and UDP is a connectionless protocol.",
    "10": "IPsec relies on two underlying protocols: AH and ESP. AH provides authentication services, and ESP provides encryption services.",
    "11": "Remember that FTP is an application layer protocol. FTP uses ports 20 and 21 and sends information unencrypted, making it unsecure.",
    "12": "Remember that SSH uses port 22 and is a more secure alternative to Telnet.",
    "13": "Telnet is used to access UNIX and Linux systems. Telnet uses port 23 and is insecure. SSH is considered the secure replacement for Telnet.",
    "14": "TFTP is an application layer protocol that uses UDP, which is a connectionless transport layer protocol. For this reason, TFTP is called a connectionless file transfer method.",
    "15": "Make sure that you understand that HTTP is a connection-oriented protocol that uses TCP as a transport protocol. By default, it operates at port 80. HTTP is insecure and has been replaced for the most part by HTTPS everywhere.",
    "16": "SNMP uses ports 161 and 162. It is a protocol that facilitates network management functionality. It is not, in itself, a network management system (NMS), simply the protocol that makes NMS possible.",
    "17": "For the exam, you should understand the SNMP concepts of Get, Trap, Walk, and MIBs.",
    "18": "You might be asked to know the differences between SNMPv2, SNMPv2c, and SNMPv3. Remember, SNMPv3 supports authentication and encryption.",
    "19": "Anytime you need to collect data outside the norm, consider SNMP. For example, one instance where it can help would be to configure SNMP traps on a network to monitor a VoIP network that is experiencing jitter and high latency.",
    "20": "Know that syslog is a standard for message logging. It is available on most network devices (e.g., routers, switches, and firewalls), as well as printers, and UNIX/Linux–based systems. Over a network, a syslog server listens for and then logs data messages coming from the syslog client. Syslog server messages are often used for troubleshooting and determining how systems may have been compromised after an attack. Remember that syslog uses port 514.",
    "21": "Remember that LDAP uses port 389, and LDAPS (secure LDAP) uses port 636.",
    "22": "Remember that Remote Desktop Protocol (RDP) can be used to remotely manage and control Windows systems and runs over port 3389.",
    "23": "SIP operates at the application layer of the OSI model and is used to maintain a multimedia session. SIP uses ports 5060 and 5061.",
    "24": "You should concentrate on the information provided in Table 1.4 and apply it to any port-related questions you might receive on the exam. For example, the exam may present you with a situation in which you can’t access a particular service; you may have to determine whether a port is open or closed on a firewall. For example, let’s say you are troubleshooting a remote Windows system with Remote Desktop Protocol (RDP), but you cannot connect to the system. We know that RDP uses port 3389. So, one of the first things to ensure is that port 3389 is open on the firewall.",
    "25": "The term well-known ports identifies the ports ranging from 0 to 1023. If/when an exam question refers to “well-known ports,” this is what it refers to. For the N+ exam, know Table 1.4 well!",
    "26": "Know the differences between unicast (one-to-one), broadcast (one-to-all), anycast (one-to-nearest), and multicast (one-to-many)."
}