{
    "0": "The OSI model can be used as a bottom-to-top troubleshooting tool. For example, troubleshooting a network interface card (NIC) or network wiring would begin at Layer 1, the physical layer where electrical functions support physical connections. If the problem is not found there, then the next step would be to run a loopback test on the NIC (moving up to Layer 2), and so on.",
    "1": "On the Network+ exam, you might see an OSI layer referenced either by its name, such as network layer, or by its layer number. For instance, you might find that a router is referred to as a Layer 3 device. An easy mnemonic that you can use to remember the layers from top to bottom is: All People Seem To Need Data Processing.",
    "2": "Be sure you understand the OSI model and its purpose. You will almost certainly be asked questions on it during the exam. Know Table 1.1 well!",
    "3": "For the Network+ exam, you are expected to identify at which layer of the OSI model certain network devices operate.",
    "4": "Adding protocol information to data as it passes through layers is known as encapsulation. Removing protocol information to data as it passes through layers is known as decapsulation.",
    "5": "Connection-oriented protocols such as TCP can accommodate lost or dropped packets by asking the sending device to retransmit them. They can do this because they wait for all the packets in a message to be received before considering the transmission complete. On the sending end, connection-oriented protocols also assume that a lack of acknowledgment is sufficient reason to retransmit.",
    "6": "As you work through the various protocols, keep an eye out for those that are connectionless and those that are connection oriented. Also, look for protocols such as TCP that guarantee delivery of data and those such as UDP that are a fire-and-forget or best-delivery method.",
    "7": "IP operates at the network layer of the OSI model.",
    "8": "TCP operates at the transport layer of the OSI model.",
    "9": "Remember that TCP is a connection-oriented protocol and UDP is a connectionless protocol.",
    "10": "IPsec relies on two underlying protocols: AH and ESP. AH provides authentication services, and ESP provides encryption services.",
    "11": "Remember that FTP is an application layer protocol. FTP uses ports 20 and 21 and sends information unencrypted, making it unsecure.",
    "12": "Remember that SSH uses port 22 and is a more secure alternative to Telnet.",
    "13": "Telnet is used to access UNIX and Linux systems. Telnet uses port 23 and is insecure. SSH is considered the secure replacement for Telnet.",
    "14": "TFTP is an application layer protocol that uses UDP, which is a connectionless transport layer protocol. For this reason, TFTP is called a connectionless file transfer method.",
    "15": "Make sure that you understand that HTTP is a connection-oriented protocol that uses TCP as a transport protocol. By default, it operates at port 80. HTTP is insecure and has been replaced for the most part by HTTPS everywhere.",
    "16": "SNMP uses ports 161 and 162. It is a protocol that facilitates network management functionality. It is not, in itself, a network management system (NMS), simply the protocol that makes NMS possible.",
    "17": "For the exam, you should understand the SNMP concepts of Get, Trap, Walk, and MIBs.",
    "18": "You might be asked to know the differences between SNMPv2, SNMPv2c, and SNMPv3. Remember, SNMPv3 supports authentication and encryption.",
    "19": "Anytime you need to collect data outside the norm, consider SNMP. For example, one instance where it can help would be to configure SNMP traps on a network to monitor a VoIP network that is experiencing jitter and high latency.",
    "20": "Know that syslog is a standard for message logging. It is available on most network devices (e.g., routers, switches, and firewalls), as well as printers, and UNIX/Linux–based systems. Over a network, a syslog server listens for and then logs data messages coming from the syslog client. Syslog server messages are often used for troubleshooting and determining how systems may have been compromised after an attack. Remember that syslog uses port 514.",
    "21": "Remember that LDAP uses port 389, and LDAPS (secure LDAP) uses port 636.",
    "22": "Remember that Remote Desktop Protocol (RDP) can be used to remotely manage and control Windows systems and runs over port 3389.",
    "23": "SIP operates at the application layer of the OSI model and is used to maintain a multimedia session. SIP uses ports 5060 and 5061.",
    "24": "You should concentrate on the information provided in Table 1.4 and apply it to any port-related questions you might receive on the exam. For example, the exam may present you with a situation in which you can’t access a particular service; you may have to determine whether a port is open or closed on a firewall. For example, let’s say you are troubleshooting a remote Windows system with Remote Desktop Protocol (RDP), but you cannot connect to the system. We know that RDP uses port 3389. So, one of the first things to ensure is that port 3389 is open on the firewall.",
    "25": "The term well-known ports identifies the ports ranging from 0 to 1023. If/when an exam question refers to “well-known ports,” this is what it refers to. For the N+ exam, know Table 1.4 well!",
    "26": "Know the differences between unicast (one-to-one), broadcast (one-to-all), anycast (one-to-nearest), and multicast (one-to-many).",
    "27": "Among the network topologies discussed in this chapter, the star topology is the easiest to expand in terms of the number of devices connected to the network.",
    "28": "Because of the redundant connections, the mesh topology offers better fault tolerance than other topologies.",
    "29": "Another meaning: The term hybrid topology also can refer to the combination of wireless and wired networks. For the Network+ exam, however, the term hybrid most likely refers to the combination of physical networks.",
    "30": "Remember that in a spine and leaf model, the spine is the backbone of the network and is responsible for interconnecting all the leaf switches in a full-mesh topology. Know, as well, that all data flows require the same number of hops, they incorporate a full-mesh switching topology, and they use software-defined networking (SDN) to direct traffic, rather than blocking ports using the Spanning Tree Protocol (STP).",
    "31": "Remember: The core layer is the backbone of the network (where the fastest routers and switches operate to manage separate networks), whereas the distribution/aggregation layer (between the access/edge and core layers) is the “boundary” layer where ACLs and Layer 3 switches operate to properly manage data between VLANs and subnetworks. The access/edge layer is the place where switches connect to and ensure data is delivered to edge/end devices, such as computers and servers.",
    "32": "East-West traffic is a concept referring to network traffic flow within a datacenter between servers. North-South refers to data transfers between the datacenter and outside the network.",
    "33": "A node or host is any device connected to the network. A node might be a client computer, a server computer, a printer, a router, or a gateway.",
    "34": "For the Network+ exam, be prepared to identify into which class a given address falls. Also be prepared to identify the IPv4 loopback address. The loopback address is 127.0.0.1. Similarly, the address used for the IPv6 loopback address is 0:0:0:0:0:0:0:1, which is normally expressed as ::1, and this is discussed a bit later.",
    "35": "You will likely see questions about address classes and the corresponding default subnet mask. Review Table 3.3 before taking the exam.",
    "36": "Subnetting does not increase the number of IP addresses available. It increases the number of network IDs and, as a result, decreases the number of node IDs per network. It also creates more broadcast domains. Broadcasts are not forwarded by routers, so they are limited to the network on which they originate.",
    "37": "You can expect questions on RFC 1918, private IP address ranges, and their corresponding default subnet masks.",
    "38": "You will likely see IP addresses in their CIDR format on the exam. Be sure that you understand CIDR addressing and IPv4 notation for the exam.",
    "39": "You will be expected to identify the purpose and function of a default gateway. You may also be asked to place the IP address of the default gateway (or other specified system) in the correct location within a performance-based question.",
    "40": "For the exam, know that any system that does not have a default gateway or any static routes configured is limited to operating on its own network segment.",
    "41": "If you wanted to ensure that a device with a specific MAC address is always assigned the same IP address from a DHCP server, you would need to configure a DHCP reservation. If it is determined that a DHCP scope has become exhausted, an administrator can reduce the DHCP lease time to free up available DHCP addresses. This eliminates the need to create a new DHCP pool.",
    "42": "Even when a network is configured to use DHCP, several mission-critical network systems continue to use static addressing: DHCP server, DNS server, web server, network printers, and more. They do not have dynamic IP addressing because their IP addresses can never change. If they do, client systems may be unable to access the resources from that server.",
    "43": "At the very minimum, an IP address and subnet mask are required to connect to a TCP/IP network. With this minimum configuration, connectivity is limited to the local segment, and DNS resolution is not possible.",
    "44": "If a system that does not support APIPA cannot get an address from a DHCP server, it typically assigns itself an IP address of 0.0.0.0. Keep this in mind when troubleshooting IP addressing problems on non-APIPA platforms.",
    "45": "Be prepared to answer APIPA questions. Know what it is and how you can tell whether you have been assigned an APIPA address and why.",
    "46": "Be sure that you know the commands used to identify the MAC address in various operating system formats.",
    "47": "Be sure that you know what EUI-64 is for the exam."
}