{
  "Which layer of the OSI model converts data from the application layer into a format that can be sent over the network?": "presentation",
  "True or false: Transport protocols, such as UDP, map to the transport layer of the OSI model and are responsible for transporting data across the network.": "True",
  "At what layer of the OSI model do HTTP and SSH map?": "application layer",
  "What is layer 7 of the OSI Model?": "Application",
  "What is layer 6 of the OSI Model?": "Presentation",
  "What is layer 5 of the OSI Model?": "Session",
  "What is layer 4 of the OSI Model?": "Transport",
  "What is layer 3 of the OSI Model?": "Network",
  "What is layer 2 of the OSI Model?": "Data Link",
  "What is layer 1 of the OSI Model?": "Physical",
  "The ________ layer of the OSI model identifies the network’s physical characteristics, including the following specifications.": "physical",
  "The ____ ____ layer is responsible for getting data to the physical layer so that it can transmit over the network.": "data link",
  "The term _____ describes the logical grouping of data at the data link layer.": "frame",
  "The data link layer has two distinct sublayers: the ___ layer & the LLC layer.": "MAC",
  "The data link layer has two distinct sublayers: the MAC layer & the ___ layer.": "LLC",
  "Within the context of the data link layer in the OSI model, what does MAC stand for?": "Media Access Control",
  "Within the context of the data link layer in the OSI model, what does LLC stand for?": "Logical Link Control",
  "The ___ address is the physical or hardware address burned into each NIC.": "MAC",
  "The primary responsibility of the _______ layer is routing, providing mechanisms by which data can be passed from one network system to another. The _______ layer does not specify how the data is passed but rather provides the mechanisms to do so. ": "network",
  "The term ______ describes the logical grouping of data at the network layer.": "packet",
  "The basic function of the _________ layer is to provide mechanisms to transport data between network devices.": "transport",
  "Protocols that operate at the _________ layer can either be connectionless, such as User Datagram Protocol (UDP), or connection oriented, such as Transmission Control Protocol (TCP).": "transport",
  "The ____________ layer’s basic function is to convert the data intended for or received from the application layer into another format.": "presentation",
  "Another important function of the ____________ layer is encryption, which is the scrambling of data so that it can’t be read by anyone other than the intended recipient. Given the basic role of the ____________ layer—that of data-format translator—it is the obvious place for encryption and decryption to take place.": "presentation",
  "In simple terms, the function of the ___________ layer is to take requests and data from the users and pass them to the lower layers of the OSI model. Incoming information is passed to the ___________ layer, which then displays the information to the users. Some of the most basic ___________ layer services include file and print capabilities.": "application",
  "Which OSI layer defines the physical structure of the network and the topology.": "physical",
  "Which OSI layer provides error detection and correction. Uses two distinct sublayers: the Media Access Control (MAC) and Logical Link Control (LLC) layers. Identifies the method by which media are accessed. Defines hardware addressing through the MAC sublayer.": "data link",
  "Which OSI layer handles the discovery of destination systems and addressing. Provides the mechanism by which data can be passed and routed from one network system to another.": "network",
  "Which OSI layer provides connection services between the sending and receiving devices and ensures reliable data delivery. Manages flow control through buffering or windowing. Provides segmentation, error checking, and service identification.": "transport",
  "Which OSI layer synchronizes the data exchange between applications on separate devices.": "session",
  "Which OSI layer translates data from the format used by applications into one that can be transmitted across the network. Handles encryption and decryption of data. Provides compression and decompression functionality. Formats data from the application layer into a format that can be sent over the network.": "presentation",
  "Which OSI layer provides access to the network for applications.": "application",
  "Adding protocol information to data as it passes through layers is known as _____________.": "encapsulation",
  "Removing protocol information to data as it passes through layers is known as _____________.": "decapsulation",
  "With TCP, a data session is established through a three-step process. This is known as a three-way _____.": "handshake",
  "The SSH protocol is a more secure alternative to what protocol?": "Telnet",
  "Which topology is commonly known as a hub and spoke model?": "star",
  "With which topology does every node have a direct connection to every other node?": "mesh",
  "True or false: Traffic flows entering and leaving a datacenter are known as East-West traffic.": "false",
  "True or false: In the three-tier hierarchical model, the access/edge layer ensures data is delivered to edge/end devices.": "true",
  "Within the context of SNMP databases, what does \"MIB\" stand for?": "Management Information Base",
  "Within the context of time-synchronization communication, what does NTP stand for?": "Network Time Protocol",
  "State the bottom-to-top mnemonic that you (Josh) will personally use to recite the 7 layers of the OSI model": "People Don't Need To See Paul Allen",
  "State the top-to-bottom mnemonic that you (Josh) will personally use to recite the 7 layers of the OSI model": "All People Seem To Need Data Processing",
  "Within the context of IPSec, what does AH stand for?": "Authentication Header",
  "Within the context of IPSec, what does ESP stand for?": "Encapsulating Security Payload",
  "FTP uses ports __ and 21 and sends information unencrypted, making it unsecure.": "20",
  "FTP uses ports 20 and __ and sends information unencrypted, making it unsecure.": "21",
  "Remember that SSH uses port __ and is a more secure alternative to Telnet.": "22",
  "Telnet is used to access UNIX and Linux systems. Telnet uses port __ and is insecure. SSH is considered the secure replacement for Telnet.": "23",
  "Make sure that you understand that HTTP is a connection-oriented protocol that uses TCP as a transport protocol. By default, it operates at port __.": "80",
  "SNMP uses ports ___ and 162. It is a protocol that facilitates network management functionality. It is not, in itself, a network management system (NMS), simply the protocol that makes NMS possible.": "161",
  "SNMP uses ports 161 and ___. It is a protocol that facilitates network management functionality. It is not, in itself, a network management system (NMS), simply the protocol that makes NMS possible.": "162",
  "Remember that syslog uses port ___.": "514",
  "Remember that LDAP uses port ___": "389",
  "Remember that LDAPS (secure LDAP) uses port ___.": "636",
  "Remember that Remote Desktop Protocol (RDP) can be used to remotely manage and control Windows systems and runs over port ____.": "3389",
  "SIP operates at the application layer of the OSI model and is used to maintain a multimedia session. SIP uses ports ____ and 5061.": "5060",
  "SIP operates at the application layer of the OSI model and is used to maintain a multimedia session. SIP uses ports 5060 and ____.": "5061"
}
