{
  "0": "A wireless access point (AP) operates at the data link layer of the OSI model. An example of a network layer device is a router. An example of a physical layer device is a hub. Session layer components normally are software, not hardware.",
  "1": "The data link layer is broken into two distinct sublayers: Media Access Control (MAC) and Logical Link Control (LLC). LCL is not a valid term. Session is another of the OSI model layers.",
  "2": "A switch uses the MAC addresses of connected devices to make its forwarding decisions. Therefore, it is called a data link, or Layer 2, network device. It can also operate at Layer 3 or be called a multilayer switch or Layer 3 switch. Devices or components that operate at Layer 1 typically are media based, such as cables or connectors. Layer 4 components typically are software based, not hardware based.",
  "3": "The transport layer is responsible for establishing a connection between networked devices. The network layer is most commonly associated with route discovery and datagram delivery. Protocols at the session layer synchronize the data exchange between applications on separate devices. Protocols at the data link layer perform error detection and handling for the transmitted signals and define the method by which the medium is accessed.",
  "4": "As data moves down the model (and through the devices on that host), it is encapsulated with a header added to the beginning and a trailer to the end. Once the data arrives at the receiving host, it moves up the model (and through the devices) and is decapsulated in that the header and trailer are stripped off as it moves up. In a windowing environment, data is sent in groups of segments that require only one acknowledgment. On the sending host system, data moves from the application layer down to the physical layer. On the receiving system, data moves from the physical layer upwards to the application layer.",
  "5": "TCP is an example of a connection-oriented transport protocol. UDP is an example of a connectionless protocol. Connection reliant and connection dependent are not terms commonly associated with protocols.",
  "6": "Both TCP and UDP are transport protocols. IP is a network protocol, and THC is not a valid protocol.",
  "7": "NTP is used to communicate time-synchronization information between devices. Network File System (NFS) is a protocol typically associated with accessing shared folders on a Linux system. Utilization information is communicated to a central management system most commonly by using SNMP.",
  "8": "TCP is a connection-oriented protocol that guarantees delivery of data. FTP is a protocol used to transfer large blocks of data. POP stands for Post Office Protocol and is not the correct choice. IP is a network layer protocol responsible for tasks such as addressing and route discovery.",
  "9": "DHCP uses port 68 by default (along with 67). DNS uses port 53, SMB uses 445, and SMTP uses port 25.",
  "10": "SNMP uses databases of information called MIBs to define what parameters are accessible, which of the parameters are read-only, and which can be set.",
  "11": "SNMP communities are logical groupings of systems. When a system is configured as part of a community, it communicates only with other devices that have the same community name.",
  "12": "NMPv3 supports authentication and encryption.",
  "13": "Internet Key Exchange (IKE) is a key management protocol used with IPsec to establish secure communication channels and negotiate cryptographic keys for encrypted VPN connections. IKE is responsible for establishing Security Associations (SAs) between communicating devices, which define the parameters for secure communication, including encryption algorithms, integrity algorithms, and authentication methods. Generic Routing Encapsulation (GRE) is a Cisco-created tunneling protocol. It is an encapsulating protocol used to wrap data and securely send it across VPNs and Point-to-Point (or point-to-multipoint) links. Server Message Block (SMB) is used on a network for providing access to resources such as files, printers, ports, and so on that are running on Windows. If you were wanting to connect Linux-based hosts to Windows-shared printers, for example, you would need to implement support for SMB; it runs, by default, on port 445. Session Initiation Protocol (SIP) is an application layer protocol designed to establish and maintain multimedia sessions, such as Internet telephony calls. This means that SIP can create communication sessions for such features as audio/videoconferencing, online gaming, and person-to-person conversations over the Internet.",
  "14": "Syslog is a standard for message logging. It is available on most network devices (e.g., routers, switches, and firewalls), as well as printers, and UNIX/Linux–based systems. Over a network, a syslog server listens for and then logs data messages coming from the syslog client. Syslog server messages are often used for troubleshooting and determining how systems may have been compromised after an attack. The Simple Network Management Protocol (SNMP) uses port 161 to send data and port 162 to receive it. It enables network devices to communicate information about their state to a central system. It also enables the central system to pass configuration parameters to the devices. SMTP TLS, more commonly known as SMTPS (Simple Mail Transfer Protocol Secure), uses Transport Layer Security (TLS) to provide authentication of the communication partners along with data integrity and confidentiality by wrapping SMTP data in TLS. This is similar to how HTTPS wraps HTTP data inside TLS. The default port for SMTPS is 587. Secure Shell (SSH) is a secure alternative to Telnet. SSH provides security by encrypting data as it travels between systems. This makes it difficult for hackers using packet sniffers and other traffic-detection systems. It also provides more robust authentication systems than Telnet. By default, SSH operates on port 22.",
  "15": "Unicast network traffic is one-to-one communication between a single sender and a single receiver, and this is the most common type of traffic in IP networks. It is used for point-to-point communication between devices, such as client/server interactions and most Internet browsing. Each packet in a unicast transmission is addressed specifically to a unique destination IP address. Data sent with unicast addressing is delivered to a specific node identified by the address. It is a point-to-point, one-to-one, address link. Multicasting is a mechanism by which groups of network devices can send and receive data between the members of the group at one time (one-to-many), instead of separately sending messages to each device in the group. The multicast grouping is established by configuring each device with the same multicast IP address. Each packet in a multicast transmission is addressed to a multicast group, identified by a multicast IP address. Anycast traffic is one-to-nearest communication from a sender to the nearest of multiple receivers. Multiple devices share the same anycast IP address, but packets are routed to the nearest (or best) destination based on routing metrics such as shortest path or lowest latency. A broadcast is at the opposite end of the spectrum from a unicast. Broadcast traffic is one-to-all communication from a single sender to all devices within a specific network segment. Each packet in a broadcast transmission is addressed to a special broadcast IP address (e.g., 255.255.255.255 in IPv4) or a Layer 2 broadcast address (e.g., MAC address FF:FF:FF:FF:FF:FF).",
  "16": "A mesh network uses a point-to-point connection to every device on the network. This creates multiple points for the data to be transmitted around the network and therefore creates a high degree of redundancy. The star/hub and spoke, ring, and bus topologies do not offer the greatest amount of fault tolerance.",
  "17": "On a star/hub and spoke network, each network device uses a separate cable to make a point-to-point connection to a centralized device, such as a hub or a switch. With such a configuration, a new device can be added to the network by attaching the new device to the hub or switch with its own cable. This process does not disrupt the users who are currently on the network. Answers A and B are incorrect because the addition of new network devices on a ring or bus network can cause a disruption in the network and cause network services to be unavailable during the installation of a new device.",
  "18": "The wired mesh topology requires each computer on the network to be individually connected to every other device. This configuration provides maximum reliability and redundancy for the network. However, it is very costly to implement because of the multiple wiring requirements.",
  "19": "North-South refers to data transfers between the datacenter and outside of the network. East-West traffic is a concept referring to network traffic flow within a datacenter between servers. On-premises can be thought of as the old, traditional approach: the data and the servers are kept in-house. Although West-to-South is a direction, it is not a valid specified data path.",
  "20": "The core layer is the backbone of the network where the fastest routers and switches operate to manage separate networks. The distribution/aggregation layer is between the access/edge and core layers. This is the “boundary” layer where ACLs and Layer 3 switches operate. The access/edge layer is the place where switches connect to and ensure data is delivered to edge/end devices. The application layer is the seventh and top layer of the OSI reference model.",
  "21": "Point-to-point topology involves a direct link between two devices, providing a dedicated connection for communication. It’s commonly used in WAN connections, such as leased lines or serial connections.",
  "22": "Spine and leaf topology is prevalent in datacenters due to its scalability and high-performance characteristics. It consists of spine switches interconnected with leaf switches, offering multiple paths and high bandwidth for data traffic.",
  "23": "With a collapsed core architecture, the three-tier model becomes a two-tier model as the core and distribution layers are combined. By collapsing the core and distribution layers into a single layer, the streamlined design provides both advantages and trade-offs. Advantages include simplicity, cost savings (via a reduced number of network devices and switches), efficient communication (with fewer layers, there are fewer network hops between devices), and scalability (it can scale relatively well for medium-sized networks and datacenters with a moderate number of devices). Network Functions Virtualization (NFV) is a technology that allows for the virtualization of a replica of a network’s physical topology and the way it behaves without changing the logical topology and the way that devices are managed. NFV allows for the virtualization of network functions such as routers, firewalls, and switches, resulting in increased flexibility and scalability. When top-of-rack (ToR) switching is incorporated into the network architecture, switches located within the same rack are connected to an in-rack network switch, which is connected to aggregation switches (usually via fiber cabling). There is no such thing as the four-tier hierarchical model.",
  "24": "The access layer in three-tier hierarchical model network architecture facilitates traffic between end devices and the rest of the network, including user data, management traffic, and control messages. The core layer is the backbone of the network, provides high-speed connectivity between distribution layers, and serves as a transit for all traffic. The distribution layer aggregates and filters traffic; enforces security policies; and implements VLANs, routing protocols, and Quality of Service (QoS). Point to point is not a layer in the three-tier hierarchical model. It is a network configuration where two devices or nodes are directly connected to each other. In this topology, there is a dedicated communication link between the two endpoints, and data flows directly between them without the involvement of any intermediary devices.",
  "25": "Class B addresses fall into the range 128 to 191. Answer A is the only address listed that falls into that range. Answer B is a Class A address, and answers C and D are Class C IP addresses.",
  "26": "When a Windows desktop system that is configured to obtain an IP address via DHCP fails to obtain an address, it uses APIPA to assign itself an address from the 169.254.x.x address range. An address of 0.0.0.0 normally results from a system that does not support APIPA. APIPA does not use the 192.168.x.x address range. The IP address 255.255.255.255 is the broadcast address. A DHCP failure would not lead to a system assigning itself this address.",
  "27": "The 127.x.x.x network range is reserved for the loopback function. It is not one of the recognized private address ranges. The private address ranges as defined in RFC 1918 are 10.x.x.x, 172.16.x.x to 172.31.x.x, and 192.168.x.x.",
  "28": "The 131.16 range is from the Class B range and is not one of the recognized private IP address ranges. All the other address ranges are valid private IP address ranges.",,,
  "29": "In CIDR terminology, the number of bits to be included in the subnet mask is expressed as a slash value. If the slash value is 24, the first three octets form the subnet mask, so the value is 255.255.255.0."
}