{
  "What protocol does ping use?": "ICMP",
  "What does ICMP stand for?": "Internet Control Message Protocol",
  "What address is used to identify the start of a network?": "Network Address",
  "What address is used to identify devices within a network?": "Host Address",
  "What is the name used to identify the device responsible for sending data to another network?": "Default Gateway",
  "___ is responsible for finding the MAC (hardware) address related to a specific IP address. It works by broadcasting an ARP query, \"Who has this IP address? Tell me.\" And the response is of the form, \"The IP address is at this MAC address.\"": "ARP",
  "What does ARP stand for?": "Address Resolution Protocol",
  "What category of ARP Packet asks a device whether or not it has a specific IP address?": "Request",
  "What category of ARP Packet responds whether a device whether or not it has a specific IP address?": "Reply",
  "What address is used as a physical identifier for a device on a network?": "MAC Address",
  "What address is used as a logical identifier for a device on a network?": "IP Address",
  "What type of DHCP packet is used by a device to retrieve an IP address?": "DHCP Discover",
  "What type of DHCP packet does a device send once it has been offered an IP address by the DHCP server?": "DHCP Request",
  "Finally, what is the last DHCP packet that is sent to a device from a DHCP server?": "DHCP Acknowledge",
  "How many layers (in digits) does the OSI model have?": "7",
  "What is the key term for when pieces of information get added to data?": "encapsulation",
  "From the 7th OSI layer to the 1st, list the layers, separated by commas and a space.": "Application, Presentation, Session, Transport, Network, Data link, Physical",
  "What is the main purpose that the Presentation layer (i.e., layer 6) acts as?": "Translator",
  "What is the technical term for when a connection is successfully established?": "Session",
  "What is the technical term for \"small chunks of data\"?": "Packets",
  "___ is a connection-oriented protocol requiring a ___ three-way-handshake to establish a connection. ___ provides reliable data transfer, flow control and congestion control. Higher-level protocols such as HTTP, POP3, IMAP and SMTP use ___": "TCP",
  "What does TCP stand for?": "Transmission Copntrol Protocol",
  "___ is a connectionless protocol; ___ does not require a connection to be established. ___ is suitable for protocols that rely on fast queries, such as DNS, and for protocols that prioritise real-time communications, such as audio/video conferencing and broadcast.": "UDP",
  "What does UDP stand for?": "User Datagram Protocol",
  "What protocol guarantees the accuracy of data?": "TCP",
  "What protocol doesn't care if data is received or not by the other device?": "UDP",
  "What protocol would an application such as an email client use?": "TCP",
  "What protocol would an application that downloads files use?": "TCP",
  "What protocol would an application that streams video use?": "UDP",
  "What does the acronym \"OSPF\" stand for?": "Open Shortest Path First",
  "What does the acronym \"RIP\" stand for?": "Routing Information Protocol"
}