{
  "What protocol does ping use?": "ICMP",
  "What does ICMP stand for?": "Internet Control Message Protocol",
  "What address is used to identify the start of a network?": "Network Address",
  "What address is used to identify devices within a network?": "Host Address",
  "What is the name used to identify the device responsible for sending data to another network?": "Default Gateway",
  "___ is responsible for finding the MAC (hardware) address related to a specific IP address. It works by broadcasting an ___ query, \"Who has this IP address? Tell me.\" And the response is of the form, \"The IP address is at this MAC address.\"": "ARP",
  "What does ARP stand for?": "Address Resolution Protocol",
  "What category of ARP Packet asks a device whether or not it has a specific IP address?": "Request",
  "What category of ARP Packet responds whether a device whether or not it has a specific IP address?": "Reply",
  "What address is used as a physical identifier for a device on a network?": "MAC Address",
  "What address is used as a logical identifier for a device on a network?": "IP Address",
  "What type of DHCP packet is used by a device to retrieve an IP address?": "DHCP Discover",
  "What type of DHCP packet does a device send once it has been offered an IP address by the DHCP server?": "DHCP Request",
  "Finally, what is the last DHCP packet that is sent to a device from a DHCP server?": "DHCP Acknowledge",
  "How many layers (in digits) does the OSI model have?": "7",
  "What is the key term for when pieces of information get added to data?": "encapsulation",
  "From the 7th OSI layer to the 1st, list the layers, separated by commas and a space.": "Application, Presentation, Session, Transport, Network, Data link, Physical",
  "What is layer 7 of the OSI model?": "Application",
  "What is layer 6 of the OSI model?": "Presentation",
  "What is layer 5 of the OSI model?": "Session",
  "What is layer 4 of the OSI model?": "Transport",
  "What is layer 3 of the OSI model?": "Network",
  "What is layer 2 of the OSI model?": "Data Link",
  "What is layer 1 of the OSI model?": "Physical",
  "What is the main purpose that the Presentation layer (i.e., layer 6) acts as?": "Translator",
  "What is the technical term for when a connection is successfully established?": "Session",
  "What is the technical term for \"small chunks of data\"?": "Packets",
  "___ is a connection-oriented protocol requiring a ___ three-way-handshake to establish a connection. ___ provides reliable data transfer, flow control and congestion control. Higher-level protocols such as HTTP, POP3, IMAP and SMTP use ___.": "TCP",
  "What does TCP stand for?": "Transmission Copntrol Protocol",
  "___ is a connectionless protocol; ___ does not require a connection to be established. ___ is suitable for protocols that rely on fast queries, such as DNS, and for protocols that prioritise real-time communications, such as audio/video conferencing and broadcast.": "UDP",
  "What does UDP stand for?": "User Datagram Protocol",
  "What protocol guarantees the accuracy of data?": "TCP",
  "What protocol doesn't care if data is received or not by the other device?": "UDP",
  "What protocol would an application such as an email client use?": "TCP",
  "What protocol would an application that downloads files use?": "TCP",
  "What protocol would an application that streams video use?": "UDP",
  "What does the acronym \"OSPF\" stand for?": "Open Shortest Path First",
  "What does the acronym \"RIP\" stand for?": "Routing Information Protocol",
  "What is the name for a piece of data when it does have IP addressing information?": "Packet",
  "What is the name for a piece of data when it does not have IP addressing information?": "Frame",
  "What is the header in a TCP packet that ensures the integrity of data?": "Checksum",
  "___ is a stateless protocol that doesn't require a constant connection between the two devices for data to be sent.": "UDP",
  "One defining feature of ___ is that it is connection-based, which means that __ must establish a connection between both a client and a device acting as a server before data is sent.": "TCP",
  "What type of connection is \"UDP\"?": "stateless",
  "What protocol would you use to transfer a file?": "TCP",
  "What protocol would you use to have a video call?": "UDP",
  "This protocol is used by a file-sharing application built on a client-server model, meaning you can download files from a central location.": "FTP",
  "What does FTP stand for?": "File Transfer Protocol",
  "Which port does FTP use?": "21",
  "This protocol is used to securely login to systems via a text-based interface for management.": "SSH",
  "What does SSH stand for?": "Secure Shell",
  "Which port does SSH use?": "22",
  "This protocol powers the World Wide Web (WWW)! Your browser uses this to download text, images and videos of web pages.": "HTTP",
  "What does HTTP stand for?": "HyperText Transfer Protocol",
  "Which port does HTTP use?": "80",
  "This protocol does the exact same as HTTP; however, securely using encryption.": "HTTPS",
  "What does HTTPS stand for?": "HyperText Transfer Protocol Secure",
  "Which port does HTTPS use?": "443",
  "This protocol is similar to FTP; however, as well as files, ___ allows you to share devices like printers; a communication protocol  It also provides an authenticated inter-process communication (IPC) mechanism.": "SMB",
  "What does SMB stand for?": "Server Message Block",
  "Which port does SMB use?": "445",
  "This protocol is a secure means of logging in to a system using a visual desktop interface (as opposed to the text-based limitations of the SSH protocol); a protocol used to establish remote graphical sessions over the network.": "RDP",
  "What does RDP stand for?": "Remote Desktop Protocol",
  "Which port does RDP use?": "3389",
  "____ __________ is an essential component in connecting applications and services to the Internet. Without ____ __________, applications and services such as web servers are only available to devices within the same direct network.": "Port Forwarding",
  "Also called \"port mapping,\" ____ __________ is directing traffic from the outside world to the appropriate server inside a local TCP/IP network.": "Port Forwarding",
  "What is the name of the device that is used to configure port forwarding?": "router",
  "A ________ is a device within a network responsible for determining what traffic is allowed to enter and exit.": "firewall",
  "This type of firewall uses the entire information from a connection; rather than inspecting an individual packet, this firewall determines the behavior of a device based upon the entire connection. This firewall type consumes many resources in comparison to stateless firewalls as the decision making is dynamic. For example, a firewall could allow the first parts of a TCP handshake that would later fail. If a connection from a host is bad, it will block the entire device.": "stateful",
  "This firewall type uses a static set of rules to determine whether or not individual packets are acceptable or not. For example, a device sending a bad packet will not necessarily mean that the entire device is then blocked. Whilst these firewalls use much fewer resources than alternatives, they are much dumber. For example, these firewalls are only effective as the rules that are defined within them. If a rule is not exactly matched, it is effectively useless. However, these firewalls are great when receiving large amounts of traffic from a set of hosts (such as a Distributed Denial-of-Service attack).": "stateless",
  "A ___ is a way to create a secure \"tunnel\" between two networks.": "VPN",
  "What does VPN stand for?": "Virtual Private Network",
  "What VPN technology only encrypts & provides the authentication of data?": "PPP",
  "What VPN technology uses the IP framework?": "IPSec",
  "Routers operate at Layer _ of the OSI model.": "3",
  "A ______ is a dedicated networking device responsible for providing a means of connecting to multiple devices.": "switch",
  "A technology called VLAN (Virtual Local Area Network) allows specific devices within a network to be virtually split up.": "VLAN",
  "What does VLAN stand for?": "Virtual Local Area Network",
  "___ is the protocol responsible for resolving hostnames, such as tryhackme.com, to their respective IP addresses.": "DNS",
  "What does DNS stand for?": "Domain Name System",
  "A ___ is the most righthand part of a domain name. So, for example, the tryhackme.com TLD is .com.": "TLD",
  "What does TLD stand for?": "Top level domain",
  "What does gTLD stand for?": "Generic Top level domain",
  "What does ccTLD stand for?": "Country Code Top level domain",
  "Taking tryhackme.com as an example, the .com part is the TLD, and tryhackme is the ______ _____ ______.": "second-level domain",
  "A _________ sits on the left-hand side of the Second Level Domain using a period to separate it; for example, in the name admin.tryhackme.com the admin part is the _________. A _________ name has the same creation restrictions as a Second-Level Domain, being limited to 63 characters and can only use a-z 0-9 and hyphens (cannot start or end with hyphens or have consecutive hyphens). You can use multiple _________s split with periods to create longer names, such as jupiter.servers.tryhackme.com. But the length must be kept to 253 characters or less. There is no limit to the number of _________s you can create for your domain name.": "subdomain",
  "What is the maximum length of a subdomain?": "63",
  "What is the maximum length of a domain name?": "253",
  "What type of TLD is .co.uk?": "ccTLD",
  "This is a DNS record that resolves to IPv4 addresses, for example 104.26.10.229.": "A record",
  "This is a DNS record that resolves to IPv6 addresses, for example 2606:4700:20::681a:be5.": "AAAA Record",
  "This is a DNS record that resolves to another domain name, for example, TryHackMe's online shop has the subdomain name store.tryhackme.com which returns a CNAME record shops.shopify.com. Another DNS request would then be made to shops.shopify.com to work out the IP address.": "CNAME Record",
  "This is a DNS record that resolves to the address of the servers that handle the email for the domain you are querying, for example an MX record response for tryhackme.com would look something like alt1.aspmx.l.google.com. These records also come with a priority flag. This tells the client in which order to try the servers, this is perfect for if the main server goes down and email needs to be sent to a backup server.": "MX Record",
  "___ _______ are free text fields where any text-based data can be stored. TXT records have multiple uses, but some common ones can be to list servers that have the authority to send an email on behalf of the domain (this can help in the battle against spam and spoofed email). They can also be used to verify ownership of the domain name when signing up for third party services.": "TXT Records",
  "What type of record would be used to advise where to send email?": "mx record",
  "What type of record handles IPv6 addresses?": "aaaa record",
  "What field specifies how long a DNS record should be cached for?": "TTL",
  "What does TTL stand for?": "Time to Live",
  "What type of DNS Server is usually provided by your ISP?": "Recursive",
  "What type of server holds all the records for a domain?": "Authoritative",
  "Which HTTP method fits the following description: used for getting information from a web server.": "GET",
  "Which HTTP method fits the following description: used for submitting data to the web server and potentially creating new records.": "POST",
  "Which HTTP method fits the following description: used for submitting data to a web server to update information.": "PUT",
  "Which HTTP method fits the following description: used for deleting information/records from a web server.": "DELETE",
  "What method would be used to create a new user account?": "POST",
  "What method would be used to update your email address?": "PUT",
  "What method would be used to remove a picture you've uploaded to your account?": "DELETE",
  "What method would be used to view a news article?": "GET",
  "Which HTTP Request Header matches the following: Some web servers host multiple websites so by providing the host headers you can tell it which one you require, otherwise you'll just receive the default website for the server.": "Host",
  "Which HTTP Request Header matches the following: This is your browser software and version number, telling the web server your browser software helps it format the website properly for your browser and also some elements of HTML, JavaScript and CSS are only available in certain browsers.": "User-Agent",
  "Which HTTP Request Header matches the following: When sending data to a web server such as in a form, the content length tells the web server how much data to expect in the web request. This way the server can ensure it isn't missing any data.": "Content-Length",
  "Which HTTP Request Header matches the following: Tells the web server what types of compression methods the browser supports so the data can be made smaller for transmitting over the internet.": "Accept-Encoding",
  "Which HTTP Request Header matches the following: Data sent to the server to help remember your information (see cookies task for more information).": "Cookie",
  "Which HTTP Response Header matches the following: Information to store which gets sent back to the web server on each request (see cookies task for more information).": "Set-Cookie",
  "Which HTTP Response Header matches the following: How long to store the content of the response in the browser's cache before it requests it again.": "Cache-Control",
  "Which HTTP Response Header matches the following: This tells the client what type of data is being returned, i.e., HTML, CSS, JavaScript, Images, PDF, Video, etc. Using the content-type header the browser then knows how to process the data.": "Content-Type",
  "Which HTTP Response Header matches the following: What method has been used to compress the data to make it smaller when sending it over the internet.": "Content-Encoding",
  "_______ ____ applications are computer programs designed to be used from a text interface; think of it as if you're using an application without a user interface.": "Command line"
}